MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
// Register: RPOR36_37
#define RPOR36_37 RPOR36_37
extern volatile unsigned char           RPOR36_37           __at(0xE24);
#ifndef _LIB_BUILD
asm("RPOR36_37 equ 0E24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO36R                 :4;
        unsigned RPO37R                 :4;
    };
    struct {
        unsigned RPO36R0                :1;
        unsigned RPO36R1                :1;
        unsigned RPO36R2                :1;
        unsigned RPO36R3                :1;
        unsigned RPO37R0                :1;
        unsigned RPO37R1                :1;
        unsigned RPO37R2                :1;
        unsigned RPO37R3                :1;
    };
} RPOR36_37bits_t;
extern volatile RPOR36_37bits_t RPOR36_37bits __at(0xE24);
// bitfield macros
#define _RPOR36_37_RPO36R_POSN                              0x0
#define _RPOR36_37_RPO36R_POSITION                          0x0
#define _RPOR36_37_RPO36R_SIZE                              0x4
#define _RPOR36_37_RPO36R_LENGTH                            0x4
#define _RPOR36_37_RPO36R_MASK                              0xF
#define _RPOR36_37_RPO37R_POSN                              0x4
#define _RPOR36_37_RPO37R_POSITION                          0x4
#define _RPOR36_37_RPO37R_SIZE                              0x4
#define _RPOR36_37_RPO37R_LENGTH                            0x4
#define _RPOR36_37_RPO37R_MASK                              0xF0
#define _RPOR36_37_RPO36R0_POSN                             0x0
#define _RPOR36_37_RPO36R0_POSITION                         0x0
#define _RPOR36_37_RPO36R0_SIZE                             0x1
#define _RPOR36_37_RPO36R0_LENGTH                           0x1
#define _RPOR36_37_RPO36R0_MASK                             0x1
#define _RPOR36_37_RPO36R1_POSN                             0x1
#define _RPOR36_37_RPO36R1_POSITION                         0x1
#define _RPOR36_37_RPO36R1_SIZE                             0x1
#define _RPOR36_37_RPO36R1_LENGTH                           0x1
#define _RPOR36_37_RPO36R1_MASK                             0x2
#define _RPOR36_37_RPO36R2_POSN                             0x2
#define _RPOR36_37_RPO36R2_POSITION                         0x2
#define _RPOR36_37_RPO36R2_SIZE                             0x1
#define _RPOR36_37_RPO36R2_LENGTH                           0x1
#define _RPOR36_37_RPO36R2_MASK                             0x4
#define _RPOR36_37_RPO36R3_POSN                             0x3
#define _RPOR36_37_RPO36R3_POSITION                         0x3
#define _RPOR36_37_RPO36R3_SIZE                             0x1
#define _RPOR36_37_RPO36R3_LENGTH                           0x1
#define _RPOR36_37_RPO36R3_MASK                             0x8
#define _RPOR36_37_RPO37R0_POSN                             0x4
#define _RPOR36_37_RPO37R0_POSITION                         0x4
#define _RPOR36_37_RPO37R0_SIZE                             0x1
#define _RPOR36_37_RPO37R0_LENGTH                           0x1
#define _RPOR36_37_RPO37R0_MASK                             0x10
#define _RPOR36_37_RPO37R1_POSN                             0x5
#define _RPOR36_37_RPO37R1_POSITION                         0x5
#define _RPOR36_37_RPO37R1_SIZE                             0x1
#define _RPOR36_37_RPO37R1_LENGTH                           0x1
#define _RPOR36_37_RPO37R1_MASK                             0x20
#define _RPOR36_37_RPO37R2_POSN                             0x6
#define _RPOR36_37_RPO37R2_POSITION                         0x6
#define _RPOR36_37_RPO37R2_SIZE                             0x1
#define _RPOR36_37_RPO37R2_LENGTH                           0x1
#define _RPOR36_37_RPO37R2_MASK                             0x40
#define _RPOR36_37_RPO37R3_POSN                             0x7
#define _RPOR36_37_RPO37R3_POSITION                         0x7
#define _RPOR36_37_RPO37R3_SIZE                             0x1
#define _RPOR36_37_RPO37R3_LENGTH                           0x1
#define _RPOR36_37_RPO37R3_MASK                             0x80

// Register: RPOR38_39
#define RPOR38_39 RPOR38_39
extern volatile unsigned char           RPOR38_39           __at(0xE25);
#ifndef _LIB_BUILD
asm("RPOR38_39 equ 0E25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO38R                 :4;
        unsigned RPO39R                 :4;
    };
    struct {
        unsigned RPO38R0                :1;
        unsigned RPO38R1                :1;
        unsigned RPO38R2                :1;
        unsigned RPO38R3                :1;
        unsigned RPO39R0                :1;
        unsigned RPO39R1                :1;
        unsigned RPO39R2                :1;
        unsigned RPO39R3                :1;
    };
} RPOR38_39bits_t;
extern volatile RPOR38_39bits_t RPOR38_39bits __at(0xE25);
// bitfield macros
#define _RPOR38_39_RPO38R_POSN                              0x0
#define _RPOR38_39_RPO38R_POSITION                          0x0
#define _RPOR38_39_RPO38R_SIZE                              0x4
#define _RPOR38_39_RPO38R_LENGTH                            0x4
#define _RPOR38_39_RPO38R_MASK                              0xF
#define _RPOR38_39_RPO39R_POSN                              0x4
#define _RPOR38_39_RPO39R_POSITION                          0x4
#define _RPOR38_39_RPO39R_SIZE                              0x4
#define _RPOR38_39_RPO39R_LENGTH                            0x4
#define _RPOR38_39_RPO39R_MASK                              0xF0
#define _RPOR38_39_RPO38R0_POSN                             0x0
#define _RPOR38_39_RPO38R0_POSITION                         0x0
#define _RPOR38_39_RPO38R0_SIZE                             0x1
#define _RPOR38_39_RPO38R0_LENGTH                           0x1
#define _RPOR38_39_RPO38R0_MASK                             0x1
#define _RPOR38_39_RPO38R1_POSN                             0x1
#define _RPOR38_39_RPO38R1_POSITION                         0x1
#define _RPOR38_39_RPO38R1_SIZE                             0x1
#define _RPOR38_39_RPO38R1_LENGTH                           0x1
#define _RPOR38_39_RPO38R1_MASK                             0x2
#define _RPOR38_39_RPO38R2_POSN                             0x2
#define _RPOR38_39_RPO38R2_POSITION                         0x2
#define _RPOR38_39_RPO38R2_SIZE                             0x1
#define _RPOR38_39_RPO38R2_LENGTH                           0x1
#define _RPOR38_39_RPO38R2_MASK                             0x4
#define _RPOR38_39_RPO38R3_POSN                             0x3
#define _RPOR38_39_RPO38R3_POSITION                         0x3
#define _RPOR38_39_RPO38R3_SIZE                             0x1
#define _RPOR38_39_RPO38R3_LENGTH                           0x1
#define _RPOR38_39_RPO38R3_MASK                             0x8
#define _RPOR38_39_RPO39R0_POSN                             0x4
#define _RPOR38_39_RPO39R0_POSITION                         0x4
#define _RPOR38_39_RPO39R0_SIZE                             0x1
#define _RPOR38_39_RPO39R0_LENGTH                           0x1
#define _RPOR38_39_RPO39R0_MASK                             0x10
#define _RPOR38_39_RPO39R1_POSN                             0x5
#define _RPOR38_39_RPO39R1_POSITION                         0x5
#define _RPOR38_39_RPO39R1_SIZE                             0x1
#define _RPOR38_39_RPO39R1_LENGTH                           0x1
#define _RPOR38_39_RPO39R1_MASK                             0x20
#define _RPOR38_39_RPO39R2_POSN                             0x6
#define _RPOR38_39_RPO39R2_POSITION                         0x6
#define _RPOR38_39_RPO39R2_SIZE                             0x1
#define _RPOR38_39_RPO39R2_LENGTH                           0x1
#define _RPOR38_39_RPO39R2_MASK                             0x40
#define _RPOR38_39_RPO39R3_POSN                             0x7
#define _RPOR38_39_RPO39R3_POSITION                         0x7
#define _RPOR38_39_RPO39R3_SIZE                             0x1
#define _RPOR38_39_RPO39R3_LENGTH                           0x1
#define _RPOR38_39_RPO39R3_MASK                             0x80

// Register: RPOR40_41
#define RPOR40_41 RPOR40_41
extern volatile unsigned char           RPOR40_41           __at(0xE26);
#ifndef _LIB_BUILD
asm("RPOR40_41 equ 0E26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO40R                 :4;
        unsigned RPO41R                 :4;
    };
    struct {
        unsigned RPO40R0                :1;
        unsigned RPO40R1                :1;
        unsigned RPO40R2                :1;
        unsigned RPO40R3                :1;
        unsigned RPO41R0                :1;
        unsigned RPO41R1                :1;
        unsigned RPO41R2                :1;
        unsigned RPO41R3                :1;
    };
} RPOR40_41bits_t;
extern volatile RPOR40_41bits_t RPOR40_41bits __at(0xE26);
// bitfield macros
#define _RPOR40_41_RPO40R_POSN                              0x0
#define _RPOR40_41_RPO40R_POSITION                          0x0
#define _RPOR40_41_RPO40R_SIZE                              0x4
#define _RPOR40_41_RPO40R_LENGTH                            0x4
#define _RPOR40_41_RPO40R_MASK                              0xF
#define _RPOR40_41_RPO41R_POSN                              0x4
#define _RPOR40_41_RPO41R_POSITION                          0x4
#define _RPOR40_41_RPO41R_SIZE                              0x4
#define _RPOR40_41_RPO41R_LENGTH                            0x4
#define _RPOR40_41_RPO41R_MASK                              0xF0
#define _RPOR40_41_RPO40R0_POSN                             0x0
#define _RPOR40_41_RPO40R0_POSITION                         0x0
#define _RPOR40_41_RPO40R0_SIZE                             0x1
#define _RPOR40_41_RPO40R0_LENGTH                           0x1
#define _RPOR40_41_RPO40R0_MASK                             0x1
#define _RPOR40_41_RPO40R1_POSN                             0x1
#define _RPOR40_41_RPO40R1_POSITION                         0x1
#define _RPOR40_41_RPO40R1_SIZE                             0x1
#define _RPOR40_41_RPO40R1_LENGTH                           0x1
#define _RPOR40_41_RPO40R1_MASK                             0x2
#define _RPOR40_41_RPO40R2_POSN                             0x2
#define _RPOR40_41_RPO40R2_POSITION                         0x2
#define _RPOR40_41_RPO40R2_SIZE                             0x1
#define _RPOR40_41_RPO40R2_LENGTH                           0x1
#define _RPOR40_41_RPO40R2_MASK                             0x4
#define _RPOR40_41_RPO40R3_POSN                             0x3
#define _RPOR40_41_RPO40R3_POSITION                         0x3
#define _RPOR40_41_RPO40R3_SIZE                             0x1
#define _RPOR40_41_RPO40R3_LENGTH                           0x1
#define _RPOR40_41_RPO40R3_MASK                             0x8
#define _RPOR40_41_RPO41R0_POSN                             0x4
#define _RPOR40_41_RPO41R0_POSITION                         0x4
#define _RPOR40_41_RPO41R0_SIZE                             0x1
#define _RPOR40_41_RPO41R0_LENGTH                           0x1
#define _RPOR40_41_RPO41R0_MASK                             0x10
#define _RPOR40_41_RPO41R1_POSN                             0x5
#define _RPOR40_41_RPO41R1_POSITION                         0x5
#define _RPOR40_41_RPO41R1_SIZE                             0x1
#define _RPOR40_41_RPO41R1_LENGTH                           0x1
#define _RPOR40_41_RPO41R1_MASK                             0x20
#define _RPOR40_41_RPO41R2_POSN                             0x6
#define _RPOR40_41_RPO41R2_POSITION                         0x6
#define _RPOR40_41_RPO41R2_SIZE                             0x1
#define _RPOR40_41_RPO41R2_LENGTH                           0x1
#define _RPOR40_41_RPO41R2_MASK                             0x40
#define _RPOR40_41_RPO41R3_POSN                             0x7
#define _RPOR40_41_RPO41R3_POSITION                         0x7
#define _RPOR40_41_RPO41R3_SIZE                             0x1
#define _RPOR40_41_RPO41R3_LENGTH                           0x1
#define _RPOR40_41_RPO41R3_MASK                             0x80

// Register: RPOR42_43
#define RPOR42_43 RPOR42_43
extern volatile unsigned char           RPOR42_43           __at(0xE27);
#ifndef _LIB_BUILD
asm("RPOR42_43 equ 0E27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO42R                 :4;
        unsigned RPO43R                 :4;
    };
    struct {
        unsigned RPO42R0                :1;
        unsigned RPO42R1                :1;
        unsigned RPO42R2                :1;
        unsigned RPO42R3                :1;
        unsigned RPO43R0                :1;
        unsigned RPO43R1                :1;
        unsigned RPO43R2                :1;
        unsigned RPO43R3                :1;
    };
} RPOR42_43bits_t;
extern volatile RPOR42_43bits_t RPOR42_43bits __at(0xE27);
// bitfield macros
#define _RPOR42_43_RPO42R_POSN                              0x0
#define _RPOR42_43_RPO42R_POSITION                          0x0
#define _RPOR42_43_RPO42R_SIZE                              0x4
#define _RPOR42_43_RPO42R_LENGTH                            0x4
#define _RPOR42_43_RPO42R_MASK                              0xF
#define _RPOR42_43_RPO43R_POSN                              0x4
#define _RPOR42_43_RPO43R_POSITION                          0x4
#define _RPOR42_43_RPO43R_SIZE                              0x4
#define _RPOR42_43_RPO43R_LENGTH                            0x4
#define _RPOR42_43_RPO43R_MASK                              0xF0
#define _RPOR42_43_RPO42R0_POSN                             0x0
#define _RPOR42_43_RPO42R0_POSITION                         0x0
#define _RPOR42_43_RPO42R0_SIZE                             0x1
#define _RPOR42_43_RPO42R0_LENGTH                           0x1
#define _RPOR42_43_RPO42R0_MASK                             0x1
#define _RPOR42_43_RPO42R1_POSN                             0x1
#define _RPOR42_43_RPO42R1_POSITION                         0x1
#define _RPOR42_43_RPO42R1_SIZE                             0x1
#define _RPOR42_43_RPO42R1_LENGTH                           0x1
#define _RPOR42_43_RPO42R1_MASK                             0x2
#define _RPOR42_43_RPO42R2_POSN                             0x2
#define _RPOR42_43_RPO42R2_POSITION                         0x2
#define _RPOR42_43_RPO42R2_SIZE                             0x1
#define _RPOR42_43_RPO42R2_LENGTH                           0x1
#define _RPOR42_43_RPO42R2_MASK                             0x4
#define _RPOR42_43_RPO42R3_POSN                             0x3
#define _RPOR42_43_RPO42R3_POSITION                         0x3
#define _RPOR42_43_RPO42R3_SIZE                             0x1
#define _RPOR42_43_RPO42R3_LENGTH                           0x1
#define _RPOR42_43_RPO42R3_MASK                             0x8
#define _RPOR42_43_RPO43R0_POSN                             0x4
#define _RPOR42_43_RPO43R0_POSITION                         0x4
#define _RPOR42_43_RPO43R0_SIZE                             0x1
#define _RPOR42_43_RPO43R0_LENGTH                           0x1
#define _RPOR42_43_RPO43R0_MASK                             0x10
#define _RPOR42_43_RPO43R1_POSN                             0x5
#define _RPOR42_43_RPO43R1_POSITION                         0x5
#define _RPOR42_43_RPO43R1_SIZE                             0x1
#define _RPOR42_43_RPO43R1_LENGTH                           0x1
#define _RPOR42_43_RPO43R1_MASK                             0x20
#define _RPOR42_43_RPO43R2_POSN                             0x6
#define _RPOR42_43_RPO43R2_POSITION                         0x6
#define _RPOR42_43_RPO43R2_SIZE                             0x1
#define _RPOR42_43_RPO43R2_LENGTH                           0x1
#define _RPOR42_43_RPO43R2_MASK                             0x40
#define _RPOR42_43_RPO43R3_POSN                             0x7
#define _RPOR42_43_RPO43R3_POSITION                         0x7
#define _RPOR42_43_RPO43R3_SIZE                             0x1
#define _RPOR42_43_RPO43R3_LENGTH                           0x1
#define _RPOR42_43_RPO43R3_MASK                             0x80

