MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
extern volatile LCDDATA40bits_t LCDDATA40bits __at(0xEB6);
// bitfield macros
#define _LCDDATA40_S00C5_POSN                               0x0
#define _LCDDATA40_S00C5_POSITION                           0x0
#define _LCDDATA40_S00C5_SIZE                               0x1
#define _LCDDATA40_S00C5_LENGTH                             0x1
#define _LCDDATA40_S00C5_MASK                               0x1
#define _LCDDATA40_S01C5_POSN                               0x1
#define _LCDDATA40_S01C5_POSITION                           0x1
#define _LCDDATA40_S01C5_SIZE                               0x1
#define _LCDDATA40_S01C5_LENGTH                             0x1
#define _LCDDATA40_S01C5_MASK                               0x2
#define _LCDDATA40_S02C5_POSN                               0x2
#define _LCDDATA40_S02C5_POSITION                           0x2
#define _LCDDATA40_S02C5_SIZE                               0x1
#define _LCDDATA40_S02C5_LENGTH                             0x1
#define _LCDDATA40_S02C5_MASK                               0x4
#define _LCDDATA40_S03C5_POSN                               0x3
#define _LCDDATA40_S03C5_POSITION                           0x3
#define _LCDDATA40_S03C5_SIZE                               0x1
#define _LCDDATA40_S03C5_LENGTH                             0x1
#define _LCDDATA40_S03C5_MASK                               0x8
#define _LCDDATA40_S04C5_POSN                               0x4
#define _LCDDATA40_S04C5_POSITION                           0x4
#define _LCDDATA40_S04C5_SIZE                               0x1
#define _LCDDATA40_S04C5_LENGTH                             0x1
#define _LCDDATA40_S04C5_MASK                               0x10
#define _LCDDATA40_S05C5_POSN                               0x5
#define _LCDDATA40_S05C5_POSITION                           0x5
#define _LCDDATA40_S05C5_SIZE                               0x1
#define _LCDDATA40_S05C5_LENGTH                             0x1
#define _LCDDATA40_S05C5_MASK                               0x20
#define _LCDDATA40_S06C5_POSN                               0x6
#define _LCDDATA40_S06C5_POSITION                           0x6
#define _LCDDATA40_S06C5_SIZE                               0x1
#define _LCDDATA40_S06C5_LENGTH                             0x1
#define _LCDDATA40_S06C5_MASK                               0x40
#define _LCDDATA40_S07C5_POSN                               0x7
#define _LCDDATA40_S07C5_POSITION                           0x7
#define _LCDDATA40_S07C5_SIZE                               0x1
#define _LCDDATA40_S07C5_LENGTH                             0x1
#define _LCDDATA40_S07C5_MASK                               0x80

// Register: LCDDATA41
#define LCDDATA41 LCDDATA41
extern volatile unsigned char           LCDDATA41           __at(0xEB7);
#ifndef _LIB_BUILD
asm("LCDDATA41 equ 0EB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C5                  :1;
        unsigned S09C5                  :1;
        unsigned S10C5                  :1;
        unsigned S11C5                  :1;
        unsigned S12C5                  :1;
        unsigned S13C5                  :1;
        unsigned S14C5                  :1;
        unsigned S15C5                  :1;
    };
} LCDDATA41bits_t;
extern volatile LCDDATA41bits_t LCDDATA41bits __at(0xEB7);
// bitfield macros
#define _LCDDATA41_S08C5_POSN                               0x0
#define _LCDDATA41_S08C5_POSITION                           0x0
#define _LCDDATA41_S08C5_SIZE                               0x1
#define _LCDDATA41_S08C5_LENGTH                             0x1
#define _LCDDATA41_S08C5_MASK                               0x1
#define _LCDDATA41_S09C5_POSN                               0x1
#define _LCDDATA41_S09C5_POSITION                           0x1
#define _LCDDATA41_S09C5_SIZE                               0x1
#define _LCDDATA41_S09C5_LENGTH                             0x1
#define _LCDDATA41_S09C5_MASK                               0x2
#define _LCDDATA41_S10C5_POSN                               0x2
#define _LCDDATA41_S10C5_POSITION                           0x2
#define _LCDDATA41_S10C5_SIZE                               0x1
#define _LCDDATA41_S10C5_LENGTH                             0x1
#define _LCDDATA41_S10C5_MASK                               0x4
#define _LCDDATA41_S11C5_POSN                               0x3
#define _LCDDATA41_S11C5_POSITION                           0x3
#define _LCDDATA41_S11C5_SIZE                               0x1
#define _LCDDATA41_S11C5_LENGTH                             0x1
#define _LCDDATA41_S11C5_MASK                               0x8
#define _LCDDATA41_S12C5_POSN                               0x4
#define _LCDDATA41_S12C5_POSITION                           0x4
#define _LCDDATA41_S12C5_SIZE                               0x1
#define _LCDDATA41_S12C5_LENGTH                             0x1
#define _LCDDATA41_S12C5_MASK                               0x10
#define _LCDDATA41_S13C5_POSN                               0x5
#define _LCDDATA41_S13C5_POSITION                           0x5
#define _LCDDATA41_S13C5_SIZE                               0x1
#define _LCDDATA41_S13C5_LENGTH                             0x1
#define _LCDDATA41_S13C5_MASK                               0x20
#define _LCDDATA41_S14C5_POSN                               0x6
#define _LCDDATA41_S14C5_POSITION                           0x6
#define _LCDDATA41_S14C5_SIZE                               0x1
#define _LCDDATA41_S14C5_LENGTH                             0x1
#define _LCDDATA41_S14C5_MASK                               0x40
#define _LCDDATA41_S15C5_POSN                               0x7
#define _LCDDATA41_S15C5_POSITION                           0x7
#define _LCDDATA41_S15C5_SIZE                               0x1
#define _LCDDATA41_S15C5_LENGTH                             0x1
#define _LCDDATA41_S15C5_MASK                               0x80

// Register: LCDDATA42
#define LCDDATA42 LCDDATA42
extern volatile unsigned char           LCDDATA42           __at(0xEB8);
#ifndef _LIB_BUILD
asm("LCDDATA42 equ 0EB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C5                  :1;
        unsigned S17C5                  :1;
        unsigned S18C5                  :1;
        unsigned S19C5                  :1;
        unsigned S20C5                  :1;
        unsigned S21C5                  :1;
        unsigned S22C5                  :1;
        unsigned S23C5                  :1;
    };
} LCDDATA42bits_t;
extern volatile LCDDATA42bits_t LCDDATA42bits __at(0xEB8);
// bitfield macros
#define _LCDDATA42_S16C5_POSN                               0x0
#define _LCDDATA42_S16C5_POSITION                           0x0
#define _LCDDATA42_S16C5_SIZE                               0x1
#define _LCDDATA42_S16C5_LENGTH                             0x1
#define _LCDDATA42_S16C5_MASK                               0x1
#define _LCDDATA42_S17C5_POSN                               0x1
#define _LCDDATA42_S17C5_POSITION                           0x1
#define _LCDDATA42_S17C5_SIZE                               0x1
#define _LCDDATA42_S17C5_LENGTH                             0x1
#define _LCDDATA42_S17C5_MASK                               0x2
#define _LCDDATA42_S18C5_POSN                               0x2
#define _LCDDATA42_S18C5_POSITION                           0x2
#define _LCDDATA42_S18C5_SIZE                               0x1
#define _LCDDATA42_S18C5_LENGTH                             0x1
#define _LCDDATA42_S18C5_MASK                               0x4
#define _LCDDATA42_S19C5_POSN                               0x3
#define _LCDDATA42_S19C5_POSITION                           0x3
#define _LCDDATA42_S19C5_SIZE                               0x1
#define _LCDDATA42_S19C5_LENGTH                             0x1
#define _LCDDATA42_S19C5_MASK                               0x8
#define _LCDDATA42_S20C5_POSN                               0x4
#define _LCDDATA42_S20C5_POSITION                           0x4
#define _LCDDATA42_S20C5_SIZE                               0x1
#define _LCDDATA42_S20C5_LENGTH                             0x1
#define _LCDDATA42_S20C5_MASK                               0x10
#define _LCDDATA42_S21C5_POSN                               0x5
#define _LCDDATA42_S21C5_POSITION                           0x5
#define _LCDDATA42_S21C5_SIZE                               0x1
#define _LCDDATA42_S21C5_LENGTH                             0x1
#define _LCDDATA42_S21C5_MASK                               0x20
#define _LCDDATA42_S22C5_POSN                               0x6
#define _LCDDATA42_S22C5_POSITION                           0x6
#define _LCDDATA42_S22C5_SIZE                               0x1
#define _LCDDATA42_S22C5_LENGTH                             0x1
#define _LCDDATA42_S22C5_MASK                               0x40
#define _LCDDATA42_S23C5_POSN                               0x7
#define _LCDDATA42_S23C5_POSITION                           0x7
#define _LCDDATA42_S23C5_SIZE                               0x1
#define _LCDDATA42_S23C5_LENGTH                             0x1
#define _LCDDATA42_S23C5_MASK                               0x80

