MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
extern volatile LCDDATA56bits_t LCDDATA56bits __at(0xEC6);
// bitfield macros
#define _LCDDATA56_S00C7_POSN                               0x0
#define _LCDDATA56_S00C7_POSITION                           0x0
#define _LCDDATA56_S00C7_SIZE                               0x1
#define _LCDDATA56_S00C7_LENGTH                             0x1
#define _LCDDATA56_S00C7_MASK                               0x1
#define _LCDDATA56_S01C7_POSN                               0x1
#define _LCDDATA56_S01C7_POSITION                           0x1
#define _LCDDATA56_S01C7_SIZE                               0x1
#define _LCDDATA56_S01C7_LENGTH                             0x1
#define _LCDDATA56_S01C7_MASK                               0x2
#define _LCDDATA56_S02C7_POSN                               0x2
#define _LCDDATA56_S02C7_POSITION                           0x2
#define _LCDDATA56_S02C7_SIZE                               0x1
#define _LCDDATA56_S02C7_LENGTH                             0x1
#define _LCDDATA56_S02C7_MASK                               0x4
#define _LCDDATA56_S03C7_POSN                               0x3
#define _LCDDATA56_S03C7_POSITION                           0x3
#define _LCDDATA56_S03C7_SIZE                               0x1
#define _LCDDATA56_S03C7_LENGTH                             0x1
#define _LCDDATA56_S03C7_MASK                               0x8
#define _LCDDATA56_S04C7_POSN                               0x4
#define _LCDDATA56_S04C7_POSITION                           0x4
#define _LCDDATA56_S04C7_SIZE                               0x1
#define _LCDDATA56_S04C7_LENGTH                             0x1
#define _LCDDATA56_S04C7_MASK                               0x10
#define _LCDDATA56_S05C7_POSN                               0x5
#define _LCDDATA56_S05C7_POSITION                           0x5
#define _LCDDATA56_S05C7_SIZE                               0x1
#define _LCDDATA56_S05C7_LENGTH                             0x1
#define _LCDDATA56_S05C7_MASK                               0x20
#define _LCDDATA56_S06C7_POSN                               0x6
#define _LCDDATA56_S06C7_POSITION                           0x6
#define _LCDDATA56_S06C7_SIZE                               0x1
#define _LCDDATA56_S06C7_LENGTH                             0x1
#define _LCDDATA56_S06C7_MASK                               0x40
#define _LCDDATA56_S07C7_POSN                               0x7
#define _LCDDATA56_S07C7_POSITION                           0x7
#define _LCDDATA56_S07C7_SIZE                               0x1
#define _LCDDATA56_S07C7_LENGTH                             0x1
#define _LCDDATA56_S07C7_MASK                               0x80

// Register: LCDDATA57
#define LCDDATA57 LCDDATA57
extern volatile unsigned char           LCDDATA57           __at(0xEC7);
#ifndef _LIB_BUILD
asm("LCDDATA57 equ 0EC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C7                  :1;
        unsigned S09C7                  :1;
        unsigned S10C7                  :1;
        unsigned S11C7                  :1;
        unsigned S12C7                  :1;
        unsigned S13C7                  :1;
        unsigned S14C7                  :1;
        unsigned S15C7                  :1;
    };
} LCDDATA57bits_t;
extern volatile LCDDATA57bits_t LCDDATA57bits __at(0xEC7);
// bitfield macros
#define _LCDDATA57_S08C7_POSN                               0x0
#define _LCDDATA57_S08C7_POSITION                           0x0
#define _LCDDATA57_S08C7_SIZE                               0x1
#define _LCDDATA57_S08C7_LENGTH                             0x1
#define _LCDDATA57_S08C7_MASK                               0x1
#define _LCDDATA57_S09C7_POSN                               0x1
#define _LCDDATA57_S09C7_POSITION                           0x1
#define _LCDDATA57_S09C7_SIZE                               0x1
#define _LCDDATA57_S09C7_LENGTH                             0x1
#define _LCDDATA57_S09C7_MASK                               0x2
#define _LCDDATA57_S10C7_POSN                               0x2
#define _LCDDATA57_S10C7_POSITION                           0x2
#define _LCDDATA57_S10C7_SIZE                               0x1
#define _LCDDATA57_S10C7_LENGTH                             0x1
#define _LCDDATA57_S10C7_MASK                               0x4
#define _LCDDATA57_S11C7_POSN                               0x3
#define _LCDDATA57_S11C7_POSITION                           0x3
#define _LCDDATA57_S11C7_SIZE                               0x1
#define _LCDDATA57_S11C7_LENGTH                             0x1
#define _LCDDATA57_S11C7_MASK                               0x8
#define _LCDDATA57_S12C7_POSN                               0x4
#define _LCDDATA57_S12C7_POSITION                           0x4
#define _LCDDATA57_S12C7_SIZE                               0x1
#define _LCDDATA57_S12C7_LENGTH                             0x1
#define _LCDDATA57_S12C7_MASK                               0x10
#define _LCDDATA57_S13C7_POSN                               0x5
#define _LCDDATA57_S13C7_POSITION                           0x5
#define _LCDDATA57_S13C7_SIZE                               0x1
#define _LCDDATA57_S13C7_LENGTH                             0x1
#define _LCDDATA57_S13C7_MASK                               0x20
#define _LCDDATA57_S14C7_POSN                               0x6
#define _LCDDATA57_S14C7_POSITION                           0x6
#define _LCDDATA57_S14C7_SIZE                               0x1
#define _LCDDATA57_S14C7_LENGTH                             0x1
#define _LCDDATA57_S14C7_MASK                               0x40
#define _LCDDATA57_S15C7_POSN                               0x7
#define _LCDDATA57_S15C7_POSITION                           0x7
#define _LCDDATA57_S15C7_SIZE                               0x1
#define _LCDDATA57_S15C7_LENGTH                             0x1
#define _LCDDATA57_S15C7_MASK                               0x80

// Register: LCDDATA58
#define LCDDATA58 LCDDATA58
extern volatile unsigned char           LCDDATA58           __at(0xEC8);
#ifndef _LIB_BUILD
asm("LCDDATA58 equ 0EC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C7                  :1;
        unsigned S17C7                  :1;
        unsigned S18C7                  :1;
        unsigned S19C7                  :1;
        unsigned S20C7                  :1;
        unsigned S21C7                  :1;
        unsigned S22C7                  :1;
        unsigned S23C7                  :1;
    };
} LCDDATA58bits_t;
extern volatile LCDDATA58bits_t LCDDATA58bits __at(0xEC8);
// bitfield macros
#define _LCDDATA58_S16C7_POSN                               0x0
#define _LCDDATA58_S16C7_POSITION                           0x0
#define _LCDDATA58_S16C7_SIZE                               0x1
#define _LCDDATA58_S16C7_LENGTH                             0x1
#define _LCDDATA58_S16C7_MASK                               0x1
#define _LCDDATA58_S17C7_POSN                               0x1
#define _LCDDATA58_S17C7_POSITION                           0x1
#define _LCDDATA58_S17C7_SIZE                               0x1
#define _LCDDATA58_S17C7_LENGTH                             0x1
#define _LCDDATA58_S17C7_MASK                               0x2
#define _LCDDATA58_S18C7_POSN                               0x2
#define _LCDDATA58_S18C7_POSITION                           0x2
#define _LCDDATA58_S18C7_SIZE                               0x1
#define _LCDDATA58_S18C7_LENGTH                             0x1
#define _LCDDATA58_S18C7_MASK                               0x4
#define _LCDDATA58_S19C7_POSN                               0x3
#define _LCDDATA58_S19C7_POSITION                           0x3
#define _LCDDATA58_S19C7_SIZE                               0x1
#define _LCDDATA58_S19C7_LENGTH                             0x1
#define _LCDDATA58_S19C7_MASK                               0x8
#define _LCDDATA58_S20C7_POSN                               0x4
#define _LCDDATA58_S20C7_POSITION                           0x4
#define _LCDDATA58_S20C7_SIZE                               0x1
#define _LCDDATA58_S20C7_LENGTH                             0x1
#define _LCDDATA58_S20C7_MASK                               0x10
#define _LCDDATA58_S21C7_POSN                               0x5
#define _LCDDATA58_S21C7_POSITION                           0x5
#define _LCDDATA58_S21C7_SIZE                               0x1
#define _LCDDATA58_S21C7_LENGTH                             0x1
#define _LCDDATA58_S21C7_MASK                               0x20
#define _LCDDATA58_S22C7_POSN                               0x6
#define _LCDDATA58_S22C7_POSITION                           0x6
#define _LCDDATA58_S22C7_SIZE                               0x1
#define _LCDDATA58_S22C7_LENGTH                             0x1
#define _LCDDATA58_S22C7_MASK                               0x40
#define _LCDDATA58_S23C7_POSN                               0x7
#define _LCDDATA58_S23C7_POSITION                           0x7
#define _LCDDATA58_S23C7_SIZE                               0x1
#define _LCDDATA58_S23C7_LENGTH                             0x1
#define _LCDDATA58_S23C7_MASK                               0x80

// Register: LCDDATA59
#define LCDDATA59 LCDDATA59
extern volatile unsigned char           LCDDATA59           __at(0xEC9);
#ifndef _LIB_BUILD
asm("LCDDATA59 equ 0EC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C7                  :1;
        unsigned S25C7                  :1;
        unsigned S26C7                  :1;
        unsigned S27C7                  :1;
        unsigned S28C7                  :1;
        unsigned S29C7                  :1;
        unsigned S30C7                  :1;
        unsigned S31C7                  :1;
    };
} LCDDATA59bits_t;
extern volatile LCDDATA59bits_t LCDDATA59bits __at(0xEC9);
// bitfield macros
#define _LCDDATA59_S24C7_POSN                               0x0
#define _LCDDATA59_S24C7_POSITION                           0x0
#define _LCDDATA59_S24C7_SIZE                               0x1
#define _LCDDATA59_S24C7_LENGTH                             0x1
#define _LCDDATA59_S24C7_MASK                               0x1
#define _LCDDATA59_S25C7_POSN                               0x1
#define _LCDDATA59_S25C7_POSITION                           0x1
#define _LCDDATA59_S25C7_SIZE                               0x1
#define _LCDDATA59_S25C7_LENGTH                             0x1
#define _LCDDATA59_S25C7_MASK                               0x2
#define _LCDDATA59_S26C7_POSN                               0x2
#define _LCDDATA59_S26C7_POSITION                           0x2
#define _LCDDATA59_S26C7_SIZE                               0x1
#define _LCDDATA59_S26C7_LENGTH                             0x1
#define _LCDDATA59_S26C7_MASK                               0x4
#define _LCDDATA59_S27C7_POSN                               0x3
#define _LCDDATA59_S27C7_POSITION                           0x3
#define _LCDDATA59_S27C7_SIZE                               0x1
#define _LCDDATA59_S27C7_LENGTH                             0x1
#define _LCDDATA59_S27C7_MASK                               0x8
#define _LCDDATA59_S28C7_POSN                               0x4
#define _LCDDATA59_S28C7_POSITION                           0x4
#define _LCDDATA59_S28C7_SIZE                               0x1
#define _LCDDATA59_S28C7_LENGTH                             0x1
#define _LCDDATA59_S28C7_MASK                               0x10
#define _LCDDATA59_S29C7_POSN                               0x5
#define _LCDDATA59_S29C7_POSITION                           0x5
#define _LCDDATA59_S29C7_SIZE                               0x1
#define _LCDDATA59_S29C7_LENGTH                             0x1
#define _LCDDATA59_S29C7_MASK                               0x20
#define _LCDDATA59_S30C7_POSN                               0x6
#define _LCDDATA59_S30C7_POSITION                           0x6
#define _LCDDATA59_S30C7_SIZE                               0x1
#define _LCDDATA59_S30C7_LENGTH                             0x1
#define _LCDDATA59_S30C7_MASK                               0x40
#define _LCDDATA59_S31C7_POSN                               0x7
#define _LCDDATA59_S31C7_POSITION                           0x7
#define _LCDDATA59_S31C7_SIZE                               0x1
#define _LCDDATA59_S31C7_LENGTH                             0x1
#define _LCDDATA59_S31C7_MASK                               0x80

