MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
// Register: LCDDATA60
#define LCDDATA60 LCDDATA60
extern volatile unsigned char           LCDDATA60           __at(0xECA);
#ifndef _LIB_BUILD
asm("LCDDATA60 equ 0ECAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C7                  :1;
        unsigned S33C7                  :1;
        unsigned S34C7                  :1;
        unsigned S35C7                  :1;
        unsigned S36C7                  :1;
        unsigned S37C7                  :1;
        unsigned S38C7                  :1;
        unsigned S39C7                  :1;
    };
} LCDDATA60bits_t;
extern volatile LCDDATA60bits_t LCDDATA60bits __at(0xECA);
// bitfield macros
#define _LCDDATA60_S32C7_POSN                               0x0
#define _LCDDATA60_S32C7_POSITION                           0x0
#define _LCDDATA60_S32C7_SIZE                               0x1
#define _LCDDATA60_S32C7_LENGTH                             0x1
#define _LCDDATA60_S32C7_MASK                               0x1
#define _LCDDATA60_S33C7_POSN                               0x1
#define _LCDDATA60_S33C7_POSITION                           0x1
#define _LCDDATA60_S33C7_SIZE                               0x1
#define _LCDDATA60_S33C7_LENGTH                             0x1
#define _LCDDATA60_S33C7_MASK                               0x2
#define _LCDDATA60_S34C7_POSN                               0x2
#define _LCDDATA60_S34C7_POSITION                           0x2
#define _LCDDATA60_S34C7_SIZE                               0x1
#define _LCDDATA60_S34C7_LENGTH                             0x1
#define _LCDDATA60_S34C7_MASK                               0x4
#define _LCDDATA60_S35C7_POSN                               0x3
#define _LCDDATA60_S35C7_POSITION                           0x3
#define _LCDDATA60_S35C7_SIZE                               0x1
#define _LCDDATA60_S35C7_LENGTH                             0x1
#define _LCDDATA60_S35C7_MASK                               0x8
#define _LCDDATA60_S36C7_POSN                               0x4
#define _LCDDATA60_S36C7_POSITION                           0x4
#define _LCDDATA60_S36C7_SIZE                               0x1
#define _LCDDATA60_S36C7_LENGTH                             0x1
#define _LCDDATA60_S36C7_MASK                               0x10
#define _LCDDATA60_S37C7_POSN                               0x5
#define _LCDDATA60_S37C7_POSITION                           0x5
#define _LCDDATA60_S37C7_SIZE                               0x1
#define _LCDDATA60_S37C7_LENGTH                             0x1
#define _LCDDATA60_S37C7_MASK                               0x20
#define _LCDDATA60_S38C7_POSN                               0x6
#define _LCDDATA60_S38C7_POSITION                           0x6
#define _LCDDATA60_S38C7_SIZE                               0x1
#define _LCDDATA60_S38C7_LENGTH                             0x1
#define _LCDDATA60_S38C7_MASK                               0x40
#define _LCDDATA60_S39C7_POSN                               0x7
#define _LCDDATA60_S39C7_POSITION                           0x7
#define _LCDDATA60_S39C7_SIZE                               0x1
#define _LCDDATA60_S39C7_LENGTH                             0x1
#define _LCDDATA60_S39C7_MASK                               0x80

// Register: LCDDATA61
#define LCDDATA61 LCDDATA61
extern volatile unsigned char           LCDDATA61           __at(0xECB);
#ifndef _LIB_BUILD
asm("LCDDATA61 equ 0ECBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C7                  :1;
        unsigned S41C7                  :1;
        unsigned S42C7                  :1;
        unsigned S43C7                  :1;
        unsigned S44C7                  :1;
        unsigned S45C7                  :1;
        unsigned S46C7                  :1;
        unsigned S47C7                  :1;
    };
} LCDDATA61bits_t;
extern volatile LCDDATA61bits_t LCDDATA61bits __at(0xECB);
// bitfield macros
#define _LCDDATA61_S40C7_POSN                               0x0
#define _LCDDATA61_S40C7_POSITION                           0x0
#define _LCDDATA61_S40C7_SIZE                               0x1
#define _LCDDATA61_S40C7_LENGTH                             0x1
#define _LCDDATA61_S40C7_MASK                               0x1
#define _LCDDATA61_S41C7_POSN                               0x1
#define _LCDDATA61_S41C7_POSITION                           0x1
#define _LCDDATA61_S41C7_SIZE                               0x1
#define _LCDDATA61_S41C7_LENGTH                             0x1
#define _LCDDATA61_S41C7_MASK                               0x2
#define _LCDDATA61_S42C7_POSN                               0x2
#define _LCDDATA61_S42C7_POSITION                           0x2
#define _LCDDATA61_S42C7_SIZE                               0x1
#define _LCDDATA61_S42C7_LENGTH                             0x1
#define _LCDDATA61_S42C7_MASK                               0x4
#define _LCDDATA61_S43C7_POSN                               0x3
#define _LCDDATA61_S43C7_POSITION                           0x3
#define _LCDDATA61_S43C7_SIZE                               0x1
#define _LCDDATA61_S43C7_LENGTH                             0x1
#define _LCDDATA61_S43C7_MASK                               0x8
#define _LCDDATA61_S44C7_POSN                               0x4
#define _LCDDATA61_S44C7_POSITION                           0x4
#define _LCDDATA61_S44C7_SIZE                               0x1
#define _LCDDATA61_S44C7_LENGTH                             0x1
#define _LCDDATA61_S44C7_MASK                               0x10
#define _LCDDATA61_S45C7_POSN                               0x5
#define _LCDDATA61_S45C7_POSITION                           0x5
#define _LCDDATA61_S45C7_SIZE                               0x1
#define _LCDDATA61_S45C7_LENGTH                             0x1
#define _LCDDATA61_S45C7_MASK                               0x20
#define _LCDDATA61_S46C7_POSN                               0x6
#define _LCDDATA61_S46C7_POSITION                           0x6
#define _LCDDATA61_S46C7_SIZE                               0x1
#define _LCDDATA61_S46C7_LENGTH                             0x1
#define _LCDDATA61_S46C7_MASK                               0x40
#define _LCDDATA61_S47C7_POSN                               0x7
#define _LCDDATA61_S47C7_POSITION                           0x7
#define _LCDDATA61_S47C7_SIZE                               0x1
#define _LCDDATA61_S47C7_LENGTH                             0x1
#define _LCDDATA61_S47C7_MASK                               0x80

