MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
// Register: LCDSE6
#define LCDSE6 LCDSE6
extern volatile unsigned char           LCDSE6              __at(0xED4);
#ifndef _LIB_BUILD
asm("LCDSE6 equ 0ED4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SE48                   :1;
        unsigned SE49                   :1;
        unsigned SE50                   :1;
        unsigned SE51                   :1;
        unsigned SE52                   :1;
        unsigned SE53                   :1;
        unsigned SE54                   :1;
        unsigned SE55                   :1;
    };
} LCDSE6bits_t;
extern volatile LCDSE6bits_t LCDSE6bits __at(0xED4);
// bitfield macros
#define _LCDSE6_SE48_POSN                                   0x0
#define _LCDSE6_SE48_POSITION                               0x0
#define _LCDSE6_SE48_SIZE                                   0x1
#define _LCDSE6_SE48_LENGTH                                 0x1
#define _LCDSE6_SE48_MASK                                   0x1
#define _LCDSE6_SE49_POSN                                   0x1
#define _LCDSE6_SE49_POSITION                               0x1
#define _LCDSE6_SE49_SIZE                                   0x1
#define _LCDSE6_SE49_LENGTH                                 0x1
#define _LCDSE6_SE49_MASK                                   0x2
#define _LCDSE6_SE50_POSN                                   0x2
#define _LCDSE6_SE50_POSITION                               0x2
#define _LCDSE6_SE50_SIZE                                   0x1
#define _LCDSE6_SE50_LENGTH                                 0x1
#define _LCDSE6_SE50_MASK                                   0x4
#define _LCDSE6_SE51_POSN                                   0x3
#define _LCDSE6_SE51_POSITION                               0x3
#define _LCDSE6_SE51_SIZE                                   0x1
#define _LCDSE6_SE51_LENGTH                                 0x1
#define _LCDSE6_SE51_MASK                                   0x8
#define _LCDSE6_SE52_POSN                                   0x4
#define _LCDSE6_SE52_POSITION                               0x4
#define _LCDSE6_SE52_SIZE                                   0x1
#define _LCDSE6_SE52_LENGTH                                 0x1
#define _LCDSE6_SE52_MASK                                   0x10
#define _LCDSE6_SE53_POSN                                   0x5
#define _LCDSE6_SE53_POSITION                               0x5
#define _LCDSE6_SE53_SIZE                                   0x1
#define _LCDSE6_SE53_LENGTH                                 0x1
#define _LCDSE6_SE53_MASK                                   0x20
#define _LCDSE6_SE54_POSN                                   0x6
#define _LCDSE6_SE54_POSITION                               0x6
#define _LCDSE6_SE54_SIZE                                   0x1
#define _LCDSE6_SE54_LENGTH                                 0x1
#define _LCDSE6_SE54_MASK                                   0x40
#define _LCDSE6_SE55_POSN                                   0x7
#define _LCDSE6_SE55_POSITION                               0x7
#define _LCDSE6_SE55_SIZE                                   0x1
#define _LCDSE6_SE55_LENGTH                                 0x1
#define _LCDSE6_SE55_MASK                                   0x80

// Register: LCDSE7
#define LCDSE7 LCDSE7
extern volatile unsigned char           LCDSE7              __at(0xED5);
#ifndef _LIB_BUILD
asm("LCDSE7 equ 0ED5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SE56                   :1;
        unsigned SE57                   :1;
        unsigned SE58                   :1;
        unsigned SE59                   :1;
        unsigned SE60                   :1;
        unsigned SE61                   :1;
        unsigned SE62                   :1;
        unsigned SE63                   :1;
    };
} LCDSE7bits_t;
extern volatile LCDSE7bits_t LCDSE7bits __at(0xED5);
// bitfield macros
#define _LCDSE7_SE56_POSN                                   0x0
#define _LCDSE7_SE56_POSITION                               0x0
#define _LCDSE7_SE56_SIZE                                   0x1
#define _LCDSE7_SE56_LENGTH                                 0x1
#define _LCDSE7_SE56_MASK                                   0x1
#define _LCDSE7_SE57_POSN                                   0x1
#define _LCDSE7_SE57_POSITION                               0x1
#define _LCDSE7_SE57_SIZE                                   0x1
#define _LCDSE7_SE57_LENGTH                                 0x1
#define _LCDSE7_SE57_MASK                                   0x2
#define _LCDSE7_SE58_POSN                                   0x2
#define _LCDSE7_SE58_POSITION                               0x2
#define _LCDSE7_SE58_SIZE                                   0x1
#define _LCDSE7_SE58_LENGTH                                 0x1
#define _LCDSE7_SE58_MASK                                   0x4
#define _LCDSE7_SE59_POSN                                   0x3
#define _LCDSE7_SE59_POSITION                               0x3
#define _LCDSE7_SE59_SIZE                                   0x1
#define _LCDSE7_SE59_LENGTH                                 0x1
#define _LCDSE7_SE59_MASK                                   0x8
#define _LCDSE7_SE60_POSN                                   0x4
#define _LCDSE7_SE60_POSITION                               0x4
#define _LCDSE7_SE60_SIZE                                   0x1
#define _LCDSE7_SE60_LENGTH                                 0x1
#define _LCDSE7_SE60_MASK                                   0x10
#define _LCDSE7_SE61_POSN                                   0x5
#define _LCDSE7_SE61_POSITION                               0x5
#define _LCDSE7_SE61_SIZE                                   0x1
#define _LCDSE7_SE61_LENGTH                                 0x1
#define _LCDSE7_SE61_MASK                                   0x20
#define _LCDSE7_SE62_POSN                                   0x6
#define _LCDSE7_SE62_POSITION                               0x6
#define _LCDSE7_SE62_SIZE                                   0x1
#define _LCDSE7_SE62_LENGTH                                 0x1
#define _LCDSE7_SE62_MASK                                   0x40
#define _LCDSE7_SE63_POSN                                   0x7
#define _LCDSE7_SE63_POSITION                               0x7
#define _LCDSE7_SE63_SIZE                                   0x1
#define _LCDSE7_SE63_LENGTH                                 0x1
#define _LCDSE7_SE63_MASK                                   0x80

// Register: LCDRL
#define LCDRL LCDRL
extern volatile unsigned char           LCDRL               __at(0xED6);
#ifndef _LIB_BUILD
asm("LCDRL equ 0ED6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LRLAT                  :3;
        unsigned                        :1;
        unsigned LRLBP                  :2;
        unsigned LRLAP                  :2;
    };
    struct {
        unsigned LRLAT0                 :1;
        unsigned LRLAT1                 :1;
        unsigned LRLAT2                 :1;
        unsigned                        :1;
        unsigned LRLBP0                 :1;
        unsigned LRLBP1                 :1;
        unsigned LRLAP0                 :1;
        unsigned LRLAP1                 :1;
    };
} LCDRLbits_t;
extern volatile LCDRLbits_t LCDRLbits __at(0xED6);
// bitfield macros
#define _LCDRL_LRLAT_POSN                                   0x0
#define _LCDRL_LRLAT_POSITION                               0x0
#define _LCDRL_LRLAT_SIZE                                   0x3
#define _LCDRL_LRLAT_LENGTH                                 0x3
#define _LCDRL_LRLAT_MASK                                   0x7
#define _LCDRL_LRLBP_POSN                                   0x4
#define _LCDRL_LRLBP_POSITION                               0x4
#define _LCDRL_LRLBP_SIZE                                   0x2
#define _LCDRL_LRLBP_LENGTH                                 0x2
#define _LCDRL_LRLBP_MASK                                   0x30
#define _LCDRL_LRLAP_POSN                                   0x6
#define _LCDRL_LRLAP_POSITION                               0x6
#define _LCDRL_LRLAP_SIZE                                   0x2
#define _LCDRL_LRLAP_LENGTH                                 0x2
#define _LCDRL_LRLAP_MASK                                   0xC0
#define _LCDRL_LRLAT0_POSN                                  0x0
#define _LCDRL_LRLAT0_POSITION                              0x0
#define _LCDRL_LRLAT0_SIZE                                  0x1
#define _LCDRL_LRLAT0_LENGTH                                0x1
#define _LCDRL_LRLAT0_MASK                                  0x1
#define _LCDRL_LRLAT1_POSN                                  0x1
#define _LCDRL_LRLAT1_POSITION                              0x1
#define _LCDRL_LRLAT1_SIZE                                  0x1
#define _LCDRL_LRLAT1_LENGTH                                0x1
#define _LCDRL_LRLAT1_MASK                                  0x2
#define _LCDRL_LRLAT2_POSN                                  0x2
#define _LCDRL_LRLAT2_POSITION                              0x2
#define _LCDRL_LRLAT2_SIZE                                  0x1
#define _LCDRL_LRLAT2_LENGTH                                0x1
#define _LCDRL_LRLAT2_MASK                                  0x4
#define _LCDRL_LRLBP0_POSN                                  0x4
#define _LCDRL_LRLBP0_POSITION                              0x4
#define _LCDRL_LRLBP0_SIZE                                  0x1
#define _LCDRL_LRLBP0_LENGTH                                0x1
#define _LCDRL_LRLBP0_MASK                                  0x10
#define _LCDRL_LRLBP1_POSN                                  0x5
#define _LCDRL_LRLBP1_POSITION                              0x5
#define _LCDRL_LRLBP1_SIZE                                  0x1
#define _LCDRL_LRLBP1_LENGTH                                0x1
#define _LCDRL_LRLBP1_MASK                                  0x20
#define _LCDRL_LRLAP0_POSN                                  0x6
#define _LCDRL_LRLAP0_POSITION                              0x6
#define _LCDRL_LRLAP0_SIZE                                  0x1
#define _LCDRL_LRLAP0_LENGTH                                0x1
#define _LCDRL_LRLAP0_MASK                                  0x40
#define _LCDRL_LRLAP1_POSN                                  0x7
#define _LCDRL_LRLAP1_POSITION                              0x7
#define _LCDRL_LRLAP1_SIZE                                  0x1
#define _LCDRL_LRLAP1_LENGTH                                0x1
#define _LCDRL_LRLAP1_MASK                                  0x80

// Register: LCDREF
#define LCDREF LCDREF
extern volatile unsigned char           LCDREF              __at(0xED7);
#ifndef _LIB_BUILD
asm("LCDREF equ 0ED7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VLCD1PE                :1;
        unsigned VLCD2PE                :1;
        unsigned VLCD3PE                :1;
        unsigned LCDCST                 :3;
        unsigned                        :1;
        unsigned LCDIRE                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned LCDCST0                :1;
        unsigned LCDCST1                :1;
        unsigned LCDCST2                :1;
    };
} LCDREFbits_t;
extern volatile LCDREFbits_t LCDREFbits __at(0xED7);
// bitfield macros
#define _LCDREF_VLCD1PE_POSN                                0x0
#define _LCDREF_VLCD1PE_POSITION                            0x0
#define _LCDREF_VLCD1PE_SIZE                                0x1
#define _LCDREF_VLCD1PE_LENGTH                              0x1
#define _LCDREF_VLCD1PE_MASK                                0x1
#define _LCDREF_VLCD2PE_POSN                                0x1
#define _LCDREF_VLCD2PE_POSITION                            0x1
#define _LCDREF_VLCD2PE_SIZE                                0x1
#define _LCDREF_VLCD2PE_LENGTH                              0x1
#define _LCDREF_VLCD2PE_MASK                                0x2
#define _LCDREF_VLCD3PE_POSN                                0x2
#define _LCDREF_VLCD3PE_POSITION                            0x2
#define _LCDREF_VLCD3PE_SIZE                                0x1
#define _LCDREF_VLCD3PE_LENGTH                              0x1
#define _LCDREF_VLCD3PE_MASK                                0x4
#define _LCDREF_LCDCST_POSN                                 0x3
#define _LCDREF_LCDCST_POSITION                             0x3
#define _LCDREF_LCDCST_SIZE                                 0x3
#define _LCDREF_LCDCST_LENGTH                               0x3
#define _LCDREF_LCDCST_MASK                                 0x38
#define _LCDREF_LCDIRE_POSN                                 0x7
#define _LCDREF_LCDIRE_POSITION                             0x7
#define _LCDREF_LCDIRE_SIZE                                 0x1
#define _LCDREF_LCDIRE_LENGTH                               0x1
#define _LCDREF_LCDIRE_MASK                                 0x80
#define _LCDREF_LCDCST0_POSN                                0x3
#define _LCDREF_LCDCST0_POSITION                            0x3
#define _LCDREF_LCDCST0_SIZE                                0x1
#define _LCDREF_LCDCST0_LENGTH                              0x1
#define _LCDREF_LCDCST0_MASK                                0x8
#define _LCDREF_LCDCST1_POSN                                0x4
#define _LCDREF_LCDCST1_POSITION                            0x4
#define _LCDREF_LCDCST1_SIZE                                0x1
#define _LCDREF_LCDCST1_LENGTH                              0x1
#define _LCDREF_LCDCST1_MASK                                0x10
#define _LCDREF_LCDCST2_POSN                                0x5
#define _LCDREF_LCDCST2_POSITION                            0x5
#define _LCDREF_LCDCST2_SIZE                                0x1
#define _LCDREF_LCDCST2_LENGTH                              0x1
#define _LCDREF_LCDCST2_MASK                                0x20

// Register: LCDREG
#define LCDREG LCDREG
extern volatile unsigned char           LCDREG              __at(0xED8);
#ifndef _LIB_BUILD
asm("LCDREG equ 0ED8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKSEL                 :2;
        unsigned MODE13                 :1;
        unsigned BIAS                   :3;
        unsigned                        :1;
        unsigned CPEN                   :1;
    };
    struct {
        unsigned CLKSEL0                :1;
        unsigned CLKSEL1                :1;
        unsigned                        :1;
        unsigned BIAS0                  :1;
        unsigned BIAS1                  :1;
        unsigned BIAS2                  :1;
    };
} LCDREGbits_t;
extern volatile LCDREGbits_t LCDREGbits __at(0xED8);
// bitfield macros
#define _LCDREG_CLKSEL_POSN                                 0x0
#define _LCDREG_CLKSEL_POSITION                             0x0
#define _LCDREG_CLKSEL_SIZE                                 0x2
#define _LCDREG_CLKSEL_LENGTH                               0x2
#define _LCDREG_CLKSEL_MASK                                 0x3
#define _LCDREG_MODE13_POSN                                 0x2
#define _LCDREG_MODE13_POSITION                             0x2
#define _LCDREG_MODE13_SIZE                                 0x1
#define _LCDREG_MODE13_LENGTH                               0x1
#define _LCDREG_MODE13_MASK                                 0x4
#define _LCDREG_BIAS_POSN                                   0x3
#define _LCDREG_BIAS_POSITION                               0x3
#define _LCDREG_BIAS_SIZE                                   0x3
#define _LCDREG_BIAS_LENGTH                                 0x3
#define _LCDREG_BIAS_MASK                                   0x38
#define _LCDREG_CPEN_POSN                                   0x7
#define _LCDREG_CPEN_POSITION                               0x7
#define _LCDREG_CPEN_SIZE                                   0x1
#define _LCDREG_CPEN_LENGTH                                 0x1
#define _LCDREG_CPEN_MASK                                   0x80
#define _LCDREG_CLKSEL0_POSN                                0x0
#define _LCDREG_CLKSEL0_POSITION                            0x0
#define _LCDREG_CLKSEL0_SIZE                                0x1
#define _LCDREG_CLKSEL0_LENGTH                              0x1
#define _LCDREG_CLKSEL0_MASK                                0x1
#define _LCDREG_CLKSEL1_POSN                                0x1
#define _LCDREG_CLKSEL1_POSITION                            0x1
#define _LCDREG_CLKSEL1_SIZE                                0x1
#define _LCDREG_CLKSEL1_LENGTH                              0x1
#define _LCDREG_CLKSEL1_MASK                                0x2
#define _LCDREG_BIAS0_POSN                                  0x3
#define _LCDREG_BIAS0_POSITION                              0x3
#define _LCDREG_BIAS0_SIZE                                  0x1
#define _LCDREG_BIAS0_LENGTH                                0x1
#define _LCDREG_BIAS0_MASK                                  0x8
#define _LCDREG_BIAS1_POSN                                  0x4
#define _LCDREG_BIAS1_POSITION                              0x4
#define _LCDREG_BIAS1_SIZE                                  0x1
#define _LCDREG_BIAS1_LENGTH                                0x1
#define _LCDREG_BIAS1_MASK                                  0x10
#define _LCDREG_BIAS2_POSN                                  0x5
#define _LCDREG_BIAS2_POSITION                              0x5
#define _LCDREG_BIAS2_SIZE                                  0x1
#define _LCDREG_BIAS2_LENGTH                                0x1
#define _LCDREG_BIAS2_MASK                                  0x20

