MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
// Register: CTMUCON3
#define CTMUCON3 CTMUCON3
extern volatile unsigned char           CTMUCON3            __at(0xEF6);
#ifndef _LIB_BUILD
asm("CTMUCON3 equ 0EF6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned EDG2SEL                :4;
        unsigned EDG2POL                :1;
        unsigned EDG2EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned EDG2SEL0               :1;
        unsigned EDG2SEL1               :1;
        unsigned EDG2SEL2               :1;
        unsigned EDG2SEL3               :1;
    };
} CTMUCON3bits_t;
extern volatile CTMUCON3bits_t CTMUCON3bits __at(0xEF6);
// bitfield macros
#define _CTMUCON3_EDG2SEL_POSN                              0x2
#define _CTMUCON3_EDG2SEL_POSITION                          0x2
#define _CTMUCON3_EDG2SEL_SIZE                              0x4
#define _CTMUCON3_EDG2SEL_LENGTH                            0x4
#define _CTMUCON3_EDG2SEL_MASK                              0x3C
#define _CTMUCON3_EDG2POL_POSN                              0x6
#define _CTMUCON3_EDG2POL_POSITION                          0x6
#define _CTMUCON3_EDG2POL_SIZE                              0x1
#define _CTMUCON3_EDG2POL_LENGTH                            0x1
#define _CTMUCON3_EDG2POL_MASK                              0x40
#define _CTMUCON3_EDG2EN_POSN                               0x7
#define _CTMUCON3_EDG2EN_POSITION                           0x7
#define _CTMUCON3_EDG2EN_SIZE                               0x1
#define _CTMUCON3_EDG2EN_LENGTH                             0x1
#define _CTMUCON3_EDG2EN_MASK                               0x80
#define _CTMUCON3_EDG2SEL0_POSN                             0x2
#define _CTMUCON3_EDG2SEL0_POSITION                         0x2
#define _CTMUCON3_EDG2SEL0_SIZE                             0x1
#define _CTMUCON3_EDG2SEL0_LENGTH                           0x1
#define _CTMUCON3_EDG2SEL0_MASK                             0x4
#define _CTMUCON3_EDG2SEL1_POSN                             0x3
#define _CTMUCON3_EDG2SEL1_POSITION                         0x3
#define _CTMUCON3_EDG2SEL1_SIZE                             0x1
#define _CTMUCON3_EDG2SEL1_LENGTH                           0x1
#define _CTMUCON3_EDG2SEL1_MASK                             0x8
#define _CTMUCON3_EDG2SEL2_POSN                             0x4
#define _CTMUCON3_EDG2SEL2_POSITION                         0x4
#define _CTMUCON3_EDG2SEL2_SIZE                             0x1
#define _CTMUCON3_EDG2SEL2_LENGTH                           0x1
#define _CTMUCON3_EDG2SEL2_MASK                             0x10
#define _CTMUCON3_EDG2SEL3_POSN                             0x5
#define _CTMUCON3_EDG2SEL3_POSITION                         0x5
#define _CTMUCON3_EDG2SEL3_SIZE                             0x1
#define _CTMUCON3_EDG2SEL3_LENGTH                           0x1
#define _CTMUCON3_EDG2SEL3_MASK                             0x20

// Register: CTMUCON2
#define CTMUCON2 CTMUCON2
extern volatile unsigned char           CTMUCON2            __at(0xEF7);
#ifndef _LIB_BUILD
asm("CTMUCON2 equ 0EF7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IRNG                   :2;
        unsigned ITRIM                  :6;
    };
    struct {
        unsigned IRNG0                  :1;
        unsigned IRNG1                  :1;
        unsigned ITRIM0                 :1;
        unsigned ITRIM1                 :1;
        unsigned ITRIM2                 :1;
        unsigned ITRIM3                 :1;
        unsigned ITRIM4                 :1;
        unsigned ITRIM5                 :1;
    };
} CTMUCON2bits_t;
extern volatile CTMUCON2bits_t CTMUCON2bits __at(0xEF7);
// bitfield macros
#define _CTMUCON2_IRNG_POSN                                 0x0
#define _CTMUCON2_IRNG_POSITION                             0x0
#define _CTMUCON2_IRNG_SIZE                                 0x2
#define _CTMUCON2_IRNG_LENGTH                               0x2
#define _CTMUCON2_IRNG_MASK                                 0x3
#define _CTMUCON2_ITRIM_POSN                                0x2
#define _CTMUCON2_ITRIM_POSITION                            0x2
#define _CTMUCON2_ITRIM_SIZE                                0x6
#define _CTMUCON2_ITRIM_LENGTH                              0x6
#define _CTMUCON2_ITRIM_MASK                                0xFC
#define _CTMUCON2_IRNG0_POSN                                0x0
#define _CTMUCON2_IRNG0_POSITION                            0x0
#define _CTMUCON2_IRNG0_SIZE                                0x1
#define _CTMUCON2_IRNG0_LENGTH                              0x1
#define _CTMUCON2_IRNG0_MASK                                0x1
#define _CTMUCON2_IRNG1_POSN                                0x1
#define _CTMUCON2_IRNG1_POSITION                            0x1
#define _CTMUCON2_IRNG1_SIZE                                0x1
#define _CTMUCON2_IRNG1_LENGTH                              0x1
#define _CTMUCON2_IRNG1_MASK                                0x2
#define _CTMUCON2_ITRIM0_POSN                               0x2
#define _CTMUCON2_ITRIM0_POSITION                           0x2
#define _CTMUCON2_ITRIM0_SIZE                               0x1
#define _CTMUCON2_ITRIM0_LENGTH                             0x1
#define _CTMUCON2_ITRIM0_MASK                               0x4
#define _CTMUCON2_ITRIM1_POSN                               0x3
#define _CTMUCON2_ITRIM1_POSITION                           0x3
#define _CTMUCON2_ITRIM1_SIZE                               0x1
#define _CTMUCON2_ITRIM1_LENGTH                             0x1
#define _CTMUCON2_ITRIM1_MASK                               0x8
#define _CTMUCON2_ITRIM2_POSN                               0x4
#define _CTMUCON2_ITRIM2_POSITION                           0x4
#define _CTMUCON2_ITRIM2_SIZE                               0x1
#define _CTMUCON2_ITRIM2_LENGTH                             0x1
#define _CTMUCON2_ITRIM2_MASK                               0x10
#define _CTMUCON2_ITRIM3_POSN                               0x5
#define _CTMUCON2_ITRIM3_POSITION                           0x5
#define _CTMUCON2_ITRIM3_SIZE                               0x1
#define _CTMUCON2_ITRIM3_LENGTH                             0x1
#define _CTMUCON2_ITRIM3_MASK                               0x20
#define _CTMUCON2_ITRIM4_POSN                               0x6
#define _CTMUCON2_ITRIM4_POSITION                           0x6
#define _CTMUCON2_ITRIM4_SIZE                               0x1
#define _CTMUCON2_ITRIM4_LENGTH                             0x1
#define _CTMUCON2_ITRIM4_MASK                               0x40
#define _CTMUCON2_ITRIM5_POSN                               0x7
#define _CTMUCON2_ITRIM5_POSITION                           0x7
#define _CTMUCON2_ITRIM5_SIZE                               0x1
#define _CTMUCON2_ITRIM5_LENGTH                             0x1
#define _CTMUCON2_ITRIM5_MASK                               0x80

