MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
#define _SSP2STAT_DA_LENGTH                                 0x1
#define _SSP2STAT_DA_MASK                                   0x20

// Register: PSTR3CON
#define PSTR3CON PSTR3CON
extern volatile unsigned char           PSTR3CON            __at(0xF1B);
#ifndef _LIB_BUILD
asm("PSTR3CON equ 0F1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned STRSYNC                :1;
        unsigned                        :1;
        unsigned CMPL                   :2;
    };
    struct {
        unsigned                        :6;
        unsigned CMPL0                  :1;
        unsigned CMPL1                  :1;
    };
    struct {
        unsigned STRA3                  :1;
        unsigned STRB3                  :1;
        unsigned STRC3                  :1;
        unsigned STRD3                  :1;
        unsigned STRSYNC3               :1;
        unsigned                        :1;
        unsigned CMPL03                 :1;
        unsigned CMPL13                 :1;
    };
    struct {
        unsigned P3DC02                 :1;
        unsigned P3DC12                 :1;
        unsigned P3DC22                 :1;
        unsigned P3DC32                 :1;
        unsigned P3DC42                 :1;
        unsigned                        :1;
        unsigned P3DC62                 :1;
    };
    struct {
        unsigned P3DC0CON               :1;
        unsigned P3DC1CON               :1;
        unsigned P3DC2CON               :1;
        unsigned P3DC3CON               :1;
        unsigned P3DC4CON               :1;
        unsigned                        :1;
        unsigned P3DC6CON               :1;
    };
} PSTR3CONbits_t;
extern volatile PSTR3CONbits_t PSTR3CONbits __at(0xF1B);
// bitfield macros
#define _PSTR3CON_STRA_POSN                                 0x0
#define _PSTR3CON_STRA_POSITION                             0x0
#define _PSTR3CON_STRA_SIZE                                 0x1
#define _PSTR3CON_STRA_LENGTH                               0x1
#define _PSTR3CON_STRA_MASK                                 0x1
#define _PSTR3CON_STRB_POSN                                 0x1
#define _PSTR3CON_STRB_POSITION                             0x1
#define _PSTR3CON_STRB_SIZE                                 0x1
#define _PSTR3CON_STRB_LENGTH                               0x1
#define _PSTR3CON_STRB_MASK                                 0x2
#define _PSTR3CON_STRC_POSN                                 0x2
#define _PSTR3CON_STRC_POSITION                             0x2
#define _PSTR3CON_STRC_SIZE                                 0x1
#define _PSTR3CON_STRC_LENGTH                               0x1
#define _PSTR3CON_STRC_MASK                                 0x4
#define _PSTR3CON_STRD_POSN                                 0x3
#define _PSTR3CON_STRD_POSITION                             0x3
#define _PSTR3CON_STRD_SIZE                                 0x1
#define _PSTR3CON_STRD_LENGTH                               0x1
#define _PSTR3CON_STRD_MASK                                 0x8
#define _PSTR3CON_STRSYNC_POSN                              0x4
#define _PSTR3CON_STRSYNC_POSITION                          0x4
#define _PSTR3CON_STRSYNC_SIZE                              0x1
#define _PSTR3CON_STRSYNC_LENGTH                            0x1
#define _PSTR3CON_STRSYNC_MASK                              0x10
#define _PSTR3CON_CMPL_POSN                                 0x6
#define _PSTR3CON_CMPL_POSITION                             0x6
#define _PSTR3CON_CMPL_SIZE                                 0x2
#define _PSTR3CON_CMPL_LENGTH                               0x2
#define _PSTR3CON_CMPL_MASK                                 0xC0
#define _PSTR3CON_CMPL0_POSN                                0x6
#define _PSTR3CON_CMPL0_POSITION                            0x6
#define _PSTR3CON_CMPL0_SIZE                                0x1
#define _PSTR3CON_CMPL0_LENGTH                              0x1
#define _PSTR3CON_CMPL0_MASK                                0x40
#define _PSTR3CON_CMPL1_POSN                                0x7
#define _PSTR3CON_CMPL1_POSITION                            0x7
#define _PSTR3CON_CMPL1_SIZE                                0x1
#define _PSTR3CON_CMPL1_LENGTH                              0x1
#define _PSTR3CON_CMPL1_MASK                                0x80
#define _PSTR3CON_STRA3_POSN                                0x0
#define _PSTR3CON_STRA3_POSITION                            0x0
#define _PSTR3CON_STRA3_SIZE                                0x1
#define _PSTR3CON_STRA3_LENGTH                              0x1
#define _PSTR3CON_STRA3_MASK                                0x1
#define _PSTR3CON_STRB3_POSN                                0x1
#define _PSTR3CON_STRB3_POSITION                            0x1
#define _PSTR3CON_STRB3_SIZE                                0x1
#define _PSTR3CON_STRB3_LENGTH                              0x1
#define _PSTR3CON_STRB3_MASK                                0x2
#define _PSTR3CON_STRC3_POSN                                0x2
#define _PSTR3CON_STRC3_POSITION                            0x2
#define _PSTR3CON_STRC3_SIZE                                0x1
#define _PSTR3CON_STRC3_LENGTH                              0x1
#define _PSTR3CON_STRC3_MASK                                0x4
#define _PSTR3CON_STRD3_POSN                                0x3
#define _PSTR3CON_STRD3_POSITION                            0x3
#define _PSTR3CON_STRD3_SIZE                                0x1
#define _PSTR3CON_STRD3_LENGTH                              0x1
#define _PSTR3CON_STRD3_MASK                                0x8
#define _PSTR3CON_STRSYNC3_POSN                             0x4
#define _PSTR3CON_STRSYNC3_POSITION                         0x4
#define _PSTR3CON_STRSYNC3_SIZE                             0x1
#define _PSTR3CON_STRSYNC3_LENGTH                           0x1
#define _PSTR3CON_STRSYNC3_MASK                             0x10
#define _PSTR3CON_CMPL03_POSN                               0x6
#define _PSTR3CON_CMPL03_POSITION                           0x6
#define _PSTR3CON_CMPL03_SIZE                               0x1
#define _PSTR3CON_CMPL03_LENGTH                             0x1
#define _PSTR3CON_CMPL03_MASK                               0x40
#define _PSTR3CON_CMPL13_POSN                               0x7
#define _PSTR3CON_CMPL13_POSITION                           0x7
#define _PSTR3CON_CMPL13_SIZE                               0x1
#define _PSTR3CON_CMPL13_LENGTH                             0x1
#define _PSTR3CON_CMPL13_MASK                               0x80
#define _PSTR3CON_P3DC02_POSN                               0x0
#define _PSTR3CON_P3DC02_POSITION                           0x0
#define _PSTR3CON_P3DC02_SIZE                               0x1
#define _PSTR3CON_P3DC02_LENGTH                             0x1
#define _PSTR3CON_P3DC02_MASK                               0x1
#define _PSTR3CON_P3DC12_POSN                               0x1
#define _PSTR3CON_P3DC12_POSITION                           0x1
#define _PSTR3CON_P3DC12_SIZE                               0x1
#define _PSTR3CON_P3DC12_LENGTH                             0x1
#define _PSTR3CON_P3DC12_MASK                               0x2
#define _PSTR3CON_P3DC22_POSN                               0x2
#define _PSTR3CON_P3DC22_POSITION                           0x2
#define _PSTR3CON_P3DC22_SIZE                               0x1
#define _PSTR3CON_P3DC22_LENGTH                             0x1
#define _PSTR3CON_P3DC22_MASK                               0x4
#define _PSTR3CON_P3DC32_POSN                               0x3
#define _PSTR3CON_P3DC32_POSITION                           0x3
#define _PSTR3CON_P3DC32_SIZE                               0x1
#define _PSTR3CON_P3DC32_LENGTH                             0x1
#define _PSTR3CON_P3DC32_MASK                               0x8
#define _PSTR3CON_P3DC42_POSN                               0x4
#define _PSTR3CON_P3DC42_POSITION                           0x4
#define _PSTR3CON_P3DC42_SIZE                               0x1
#define _PSTR3CON_P3DC42_LENGTH                             0x1
#define _PSTR3CON_P3DC42_MASK                               0x10
#define _PSTR3CON_P3DC62_POSN                               0x6
#define _PSTR3CON_P3DC62_POSITION                           0x6
#define _PSTR3CON_P3DC62_SIZE                               0x1
#define _PSTR3CON_P3DC62_LENGTH                             0x1
#define _PSTR3CON_P3DC62_MASK                               0x40
#define _PSTR3CON_P3DC0CON_POSN                             0x0
#define _PSTR3CON_P3DC0CON_POSITION                         0x0
#define _PSTR3CON_P3DC0CON_SIZE                             0x1
#define _PSTR3CON_P3DC0CON_LENGTH                           0x1
#define _PSTR3CON_P3DC0CON_MASK                             0x1
#define _PSTR3CON_P3DC1CON_POSN                             0x1
#define _PSTR3CON_P3DC1CON_POSITION                         0x1
#define _PSTR3CON_P3DC1CON_SIZE                             0x1
#define _PSTR3CON_P3DC1CON_LENGTH                           0x1
#define _PSTR3CON_P3DC1CON_MASK                             0x2
#define _PSTR3CON_P3DC2CON_POSN                             0x2
#define _PSTR3CON_P3DC2CON_POSITION                         0x2
#define _PSTR3CON_P3DC2CON_SIZE                             0x1
#define _PSTR3CON_P3DC2CON_LENGTH                           0x1
#define _PSTR3CON_P3DC2CON_MASK                             0x4
#define _PSTR3CON_P3DC3CON_POSN                             0x3
#define _PSTR3CON_P3DC3CON_POSITION                         0x3
#define _PSTR3CON_P3DC3CON_SIZE                             0x1
#define _PSTR3CON_P3DC3CON_LENGTH                           0x1
#define _PSTR3CON_P3DC3CON_MASK                             0x8
#define _PSTR3CON_P3DC4CON_POSN                             0x4
#define _PSTR3CON_P3DC4CON_POSITION                         0x4
#define _PSTR3CON_P3DC4CON_SIZE                             0x1
#define _PSTR3CON_P3DC4CON_LENGTH                           0x1
#define _PSTR3CON_P3DC4CON_MASK                             0x10
#define _PSTR3CON_P3DC6CON_POSN                             0x6
#define _PSTR3CON_P3DC6CON_POSITION                         0x6
#define _PSTR3CON_P3DC6CON_SIZE                             0x1
#define _PSTR3CON_P3DC6CON_LENGTH                           0x1
#define _PSTR3CON_P3DC6CON_MASK                             0x40

