MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
extern volatile PSTR1CONbits_t PSTR1CONbits __at(0xF9C);
// bitfield macros
#define _PSTR1CON_STRA_POSN                                 0x0
#define _PSTR1CON_STRA_POSITION                             0x0
#define _PSTR1CON_STRA_SIZE                                 0x1
#define _PSTR1CON_STRA_LENGTH                               0x1
#define _PSTR1CON_STRA_MASK                                 0x1
#define _PSTR1CON_STRB_POSN                                 0x1
#define _PSTR1CON_STRB_POSITION                             0x1
#define _PSTR1CON_STRB_SIZE                                 0x1
#define _PSTR1CON_STRB_LENGTH                               0x1
#define _PSTR1CON_STRB_MASK                                 0x2
#define _PSTR1CON_STRC_POSN                                 0x2
#define _PSTR1CON_STRC_POSITION                             0x2
#define _PSTR1CON_STRC_SIZE                                 0x1
#define _PSTR1CON_STRC_LENGTH                               0x1
#define _PSTR1CON_STRC_MASK                                 0x4
#define _PSTR1CON_STRD_POSN                                 0x3
#define _PSTR1CON_STRD_POSITION                             0x3
#define _PSTR1CON_STRD_SIZE                                 0x1
#define _PSTR1CON_STRD_LENGTH                               0x1
#define _PSTR1CON_STRD_MASK                                 0x8
#define _PSTR1CON_STRSYNC_POSN                              0x4
#define _PSTR1CON_STRSYNC_POSITION                          0x4
#define _PSTR1CON_STRSYNC_SIZE                              0x1
#define _PSTR1CON_STRSYNC_LENGTH                            0x1
#define _PSTR1CON_STRSYNC_MASK                              0x10
#define _PSTR1CON_CMPL_POSN                                 0x6
#define _PSTR1CON_CMPL_POSITION                             0x6
#define _PSTR1CON_CMPL_SIZE                                 0x2
#define _PSTR1CON_CMPL_LENGTH                               0x2
#define _PSTR1CON_CMPL_MASK                                 0xC0
#define _PSTR1CON_CMPL0_POSN                                0x6
#define _PSTR1CON_CMPL0_POSITION                            0x6
#define _PSTR1CON_CMPL0_SIZE                                0x1
#define _PSTR1CON_CMPL0_LENGTH                              0x1
#define _PSTR1CON_CMPL0_MASK                                0x40
#define _PSTR1CON_CMPL1_POSN                                0x7
#define _PSTR1CON_CMPL1_POSITION                            0x7
#define _PSTR1CON_CMPL1_SIZE                                0x1
#define _PSTR1CON_CMPL1_LENGTH                              0x1
#define _PSTR1CON_CMPL1_MASK                                0x80
#define _PSTR1CON_STRA1_POSN                                0x0
#define _PSTR1CON_STRA1_POSITION                            0x0
#define _PSTR1CON_STRA1_SIZE                                0x1
#define _PSTR1CON_STRA1_LENGTH                              0x1
#define _PSTR1CON_STRA1_MASK                                0x1
#define _PSTR1CON_STRB1_POSN                                0x1
#define _PSTR1CON_STRB1_POSITION                            0x1
#define _PSTR1CON_STRB1_SIZE                                0x1
#define _PSTR1CON_STRB1_LENGTH                              0x1
#define _PSTR1CON_STRB1_MASK                                0x2
#define _PSTR1CON_STRC1_POSN                                0x2
#define _PSTR1CON_STRC1_POSITION                            0x2
#define _PSTR1CON_STRC1_SIZE                                0x1
#define _PSTR1CON_STRC1_LENGTH                              0x1
#define _PSTR1CON_STRC1_MASK                                0x4
#define _PSTR1CON_STRD1_POSN                                0x3
#define _PSTR1CON_STRD1_POSITION                            0x3
#define _PSTR1CON_STRD1_SIZE                                0x1
#define _PSTR1CON_STRD1_LENGTH                              0x1
#define _PSTR1CON_STRD1_MASK                                0x8
#define _PSTR1CON_STRSYNC1_POSN                             0x4
#define _PSTR1CON_STRSYNC1_POSITION                         0x4
#define _PSTR1CON_STRSYNC1_SIZE                             0x1
#define _PSTR1CON_STRSYNC1_LENGTH                           0x1
#define _PSTR1CON_STRSYNC1_MASK                             0x10
#define _PSTR1CON_CMPL01_POSN                               0x6
#define _PSTR1CON_CMPL01_POSITION                           0x6
#define _PSTR1CON_CMPL01_SIZE                               0x1
#define _PSTR1CON_CMPL01_LENGTH                             0x1
#define _PSTR1CON_CMPL01_MASK                               0x40
#define _PSTR1CON_CMPL11_POSN                               0x7
#define _PSTR1CON_CMPL11_POSITION                           0x7
#define _PSTR1CON_CMPL11_SIZE                               0x1
#define _PSTR1CON_CMPL11_LENGTH                             0x1
#define _PSTR1CON_CMPL11_MASK                               0x80
#define _PSTR1CON_P1DC02_POSN                               0x0
#define _PSTR1CON_P1DC02_POSITION                           0x0
#define _PSTR1CON_P1DC02_SIZE                               0x1
#define _PSTR1CON_P1DC02_LENGTH                             0x1
#define _PSTR1CON_P1DC02_MASK                               0x1
#define _PSTR1CON_P1DC12_POSN                               0x1
#define _PSTR1CON_P1DC12_POSITION                           0x1
#define _PSTR1CON_P1DC12_SIZE                               0x1
#define _PSTR1CON_P1DC12_LENGTH                             0x1
#define _PSTR1CON_P1DC12_MASK                               0x2
#define _PSTR1CON_P1DC22_POSN                               0x2
#define _PSTR1CON_P1DC22_POSITION                           0x2
#define _PSTR1CON_P1DC22_SIZE                               0x1
#define _PSTR1CON_P1DC22_LENGTH                             0x1
#define _PSTR1CON_P1DC22_MASK                               0x4
#define _PSTR1CON_P1DC32_POSN                               0x3
#define _PSTR1CON_P1DC32_POSITION                           0x3
#define _PSTR1CON_P1DC32_SIZE                               0x1
#define _PSTR1CON_P1DC32_LENGTH                             0x1
#define _PSTR1CON_P1DC32_MASK                               0x8
#define _PSTR1CON_P1DC42_POSN                               0x4
#define _PSTR1CON_P1DC42_POSITION                           0x4
#define _PSTR1CON_P1DC42_SIZE                               0x1
#define _PSTR1CON_P1DC42_LENGTH                             0x1
#define _PSTR1CON_P1DC42_MASK                               0x10
#define _PSTR1CON_P1DC62_POSN                               0x6
#define _PSTR1CON_P1DC62_POSITION                           0x6
#define _PSTR1CON_P1DC62_SIZE                               0x1
#define _PSTR1CON_P1DC62_LENGTH                             0x1
#define _PSTR1CON_P1DC62_MASK                               0x40
#define _PSTR1CON_P1DC0CON_POSN                             0x0
#define _PSTR1CON_P1DC0CON_POSITION                         0x0
#define _PSTR1CON_P1DC0CON_SIZE                             0x1
#define _PSTR1CON_P1DC0CON_LENGTH                           0x1
#define _PSTR1CON_P1DC0CON_MASK                             0x1
#define _PSTR1CON_P1DC1CON_POSN                             0x1
#define _PSTR1CON_P1DC1CON_POSITION                         0x1
#define _PSTR1CON_P1DC1CON_SIZE                             0x1
#define _PSTR1CON_P1DC1CON_LENGTH                           0x1
#define _PSTR1CON_P1DC1CON_MASK                             0x2
#define _PSTR1CON_P1DC2CON_POSN                             0x2
#define _PSTR1CON_P1DC2CON_POSITION                         0x2
#define _PSTR1CON_P1DC2CON_SIZE                             0x1
#define _PSTR1CON_P1DC2CON_LENGTH                           0x1
#define _PSTR1CON_P1DC2CON_MASK                             0x4
#define _PSTR1CON_P1DC3CON_POSN                             0x3
#define _PSTR1CON_P1DC3CON_POSITION                         0x3
#define _PSTR1CON_P1DC3CON_SIZE                             0x1
#define _PSTR1CON_P1DC3CON_LENGTH                           0x1
#define _PSTR1CON_P1DC3CON_MASK                             0x8
#define _PSTR1CON_P1DC4CON_POSN                             0x4
#define _PSTR1CON_P1DC4CON_POSITION                         0x4
#define _PSTR1CON_P1DC4CON_SIZE                             0x1
#define _PSTR1CON_P1DC4CON_LENGTH                           0x1
#define _PSTR1CON_P1DC4CON_MASK                             0x10
#define _PSTR1CON_P1DC6CON_POSN                             0x6
#define _PSTR1CON_P1DC6CON_POSITION                         0x6
#define _PSTR1CON_P1DC6CON_SIZE                             0x1
#define _PSTR1CON_P1DC6CON_LENGTH                           0x1
#define _PSTR1CON_P1DC6CON_MASK                             0x40

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0xF9D);
#ifndef _LIB_BUILD
asm("PIE1 equ 0F9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IE                 :1;
        unsigned TMR2IE                 :1;
        unsigned TMR1GIE                :1;
        unsigned SSP1IE                 :1;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
        unsigned ADIE                   :1;
        unsigned PSPIE                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXIE                   :1;
    };
} PIE1bits_t;
