MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
extern volatile __bit                   CCP4M3              __at(0x7883);	// @ (0xF10 * 8 + 3)
#define                                 CCP4M3_bit          _BIT_ACCESS(CCP4CON,3)
// PMD0<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x77A1);	// @ (0xEF4 * 8 + 1)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMD0,1)
// ODCON2<CCP4OD>
extern volatile __bit                   CCP4OD              __at(0x7751);	// @ (0xEEA * 8 + 1)
#define                                 CCP4OD_bit          _BIT_ACCESS(ODCON2,1)
// RPINR32_33<CCP4R0>
extern volatile __bit                   CCP4R0              __at(0x71D0);	// @ (0xE3A * 8 + 0)
#define                                 CCP4R0_bit          _BIT_ACCESS(RPINR32_33,0)
// RPINR32_33<CCP4R1>
extern volatile __bit                   CCP4R1              __at(0x71D1);	// @ (0xE3A * 8 + 1)
#define                                 CCP4R1_bit          _BIT_ACCESS(RPINR32_33,1)
// RPINR32_33<CCP4R2>
extern volatile __bit                   CCP4R2              __at(0x71D2);	// @ (0xE3A * 8 + 2)
#define                                 CCP4R2_bit          _BIT_ACCESS(RPINR32_33,2)
// RPINR32_33<CCP4R3>
extern volatile __bit                   CCP4R3              __at(0x71D3);	// @ (0xE3A * 8 + 3)
#define                                 CCP4R3_bit          _BIT_ACCESS(RPINR32_33,3)
// CCP4CON<CCP4X>
extern volatile __bit                   CCP4X               __at(0x7885);	// @ (0xF10 * 8 + 5)
#define                                 CCP4X_bit           _BIT_ACCESS(CCP4CON,5)
// CCP4CON<CCP4Y>
extern volatile __bit                   CCP4Y               __at(0x7884);	// @ (0xF10 * 8 + 4)
#define                                 CCP4Y_bit           _BIT_ACCESS(CCP4CON,4)
// PIE4<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x7DA2);	// @ (0xFB4 * 8 + 2)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x7DAA);	// @ (0xFB5 * 8 + 2)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR4,2)
// IPR4<CCP5IP>
extern volatile __bit                   CCP5IP              __at(0x7DB2);	// @ (0xFB6 * 8 + 2)
#define                                 CCP5IP_bit          _BIT_ACCESS(IPR4,2)
// CCP5CON<CCP5M0>
extern volatile __bit                   CCP5M0              __at(0x7868);	// @ (0xF0D * 8 + 0)
#define                                 CCP5M0_bit          _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5M1>
extern volatile __bit                   CCP5M1              __at(0x7869);	// @ (0xF0D * 8 + 1)
#define                                 CCP5M1_bit          _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5M2>
extern volatile __bit                   CCP5M2              __at(0x786A);	// @ (0xF0D * 8 + 2)
#define                                 CCP5M2_bit          _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5M3>
extern volatile __bit                   CCP5M3              __at(0x786B);	// @ (0xF0D * 8 + 3)
#define                                 CCP5M3_bit          _BIT_ACCESS(CCP5CON,3)
// PMD0<CCP5MD>
extern volatile __bit                   CCP5MD              __at(0x77A2);	// @ (0xEF4 * 8 + 2)
#define                                 CCP5MD_bit          _BIT_ACCESS(PMD0,2)
// ODCON2<CCP5OD>
extern volatile __bit                   CCP5OD              __at(0x7752);	// @ (0xEEA * 8 + 2)
#define                                 CCP5OD_bit          _BIT_ACCESS(ODCON2,2)
// RPINR32_33<CCP5R0>
extern volatile __bit                   CCP5R0              __at(0x71D4);	// @ (0xE3A * 8 + 4)
#define                                 CCP5R0_bit          _BIT_ACCESS(RPINR32_33,4)
// RPINR32_33<CCP5R1>
extern volatile __bit                   CCP5R1              __at(0x71D5);	// @ (0xE3A * 8 + 5)
#define                                 CCP5R1_bit          _BIT_ACCESS(RPINR32_33,5)
// RPINR32_33<CCP5R2>
extern volatile __bit                   CCP5R2              __at(0x71D6);	// @ (0xE3A * 8 + 6)
#define                                 CCP5R2_bit          _BIT_ACCESS(RPINR32_33,6)
// RPINR32_33<CCP5R3>
extern volatile __bit                   CCP5R3              __at(0x71D7);	// @ (0xE3A * 8 + 7)
#define                                 CCP5R3_bit          _BIT_ACCESS(RPINR32_33,7)
// CCP5CON<CCP5X>
extern volatile __bit                   CCP5X               __at(0x786D);	// @ (0xF0D * 8 + 5)
#define                                 CCP5X_bit           _BIT_ACCESS(CCP5CON,5)
// CCP5CON<CCP5Y>
extern volatile __bit                   CCP5Y               __at(0x786C);	// @ (0xF0D * 8 + 4)
#define                                 CCP5Y_bit           _BIT_ACCESS(CCP5CON,4)
// PORTH<CCP6>
extern volatile __bit                   CCP6                __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 CCP6_bit            _BIT_ACCESS(PORTH,7)
// PORTE<CCP6E>
extern volatile __bit                   CCP6E               __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 CCP6E_bit           _BIT_ACCESS(PORTE,6)
// PIE4<CCP6IE>
extern volatile __bit                   CCP6IE              __at(0x7DA3);	// @ (0xFB4 * 8 + 3)
#define                                 CCP6IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<CCP6IF>
extern volatile __bit                   CCP6IF              __at(0x7DAB);	// @ (0xFB5 * 8 + 3)
#define                                 CCP6IF_bit          _BIT_ACCESS(PIR4,3)
// IPR4<CCP6IP>
extern volatile __bit                   CCP6IP              __at(0x7DB3);	// @ (0xFB6 * 8 + 3)
#define                                 CCP6IP_bit          _BIT_ACCESS(IPR4,3)
// CCP6CON<CCP6M0>
extern volatile __bit                   CCP6M0              __at(0x7850);	// @ (0xF0A * 8 + 0)
#define                                 CCP6M0_bit          _BIT_ACCESS(CCP6CON,0)
// CCP6CON<CCP6M1>
extern volatile __bit                   CCP6M1              __at(0x7851);	// @ (0xF0A * 8 + 1)
#define                                 CCP6M1_bit          _BIT_ACCESS(CCP6CON,1)
// CCP6CON<CCP6M2>
extern volatile __bit                   CCP6M2              __at(0x7852);	// @ (0xF0A * 8 + 2)
#define                                 CCP6M2_bit          _BIT_ACCESS(CCP6CON,2)
// CCP6CON<CCP6M3>
extern volatile __bit                   CCP6M3              __at(0x7853);	// @ (0xF0A * 8 + 3)
#define                                 CCP6M3_bit          _BIT_ACCESS(CCP6CON,3)
// PMD0<CCP6MD>
extern volatile __bit                   CCP6MD              __at(0x77A3);	// @ (0xEF4 * 8 + 3)
#define                                 CCP6MD_bit          _BIT_ACCESS(PMD0,3)
// ODCON2<CCP6OD>
extern volatile __bit                   CCP6OD              __at(0x7753);	// @ (0xEEA * 8 + 3)
#define                                 CCP6OD_bit          _BIT_ACCESS(ODCON2,3)
// RPINR34_35<CCP6R0>
extern volatile __bit                   CCP6R0              __at(0x71D8);	// @ (0xE3B * 8 + 0)
#define                                 CCP6R0_bit          _BIT_ACCESS(RPINR34_35,0)
// RPINR34_35<CCP6R1>
extern volatile __bit                   CCP6R1              __at(0x71D9);	// @ (0xE3B * 8 + 1)
#define                                 CCP6R1_bit          _BIT_ACCESS(RPINR34_35,1)
// RPINR34_35<CCP6R2>
extern volatile __bit                   CCP6R2              __at(0x71DA);	// @ (0xE3B * 8 + 2)
#define                                 CCP6R2_bit          _BIT_ACCESS(RPINR34_35,2)
// RPINR34_35<CCP6R3>
extern volatile __bit                   CCP6R3              __at(0x71DB);	// @ (0xE3B * 8 + 3)
#define                                 CCP6R3_bit          _BIT_ACCESS(RPINR34_35,3)
// CCP6CON<CCP6X>
extern volatile __bit                   CCP6X               __at(0x7855);	// @ (0xF0A * 8 + 5)
#define                                 CCP6X_bit           _BIT_ACCESS(CCP6CON,5)
// CCP6CON<CCP6Y>
extern volatile __bit                   CCP6Y               __at(0x7854);	// @ (0xF0A * 8 + 4)
#define                                 CCP6Y_bit           _BIT_ACCESS(CCP6CON,4)
// PORTH<CCP7>
extern volatile __bit                   CCP7                __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 CCP7_bit            _BIT_ACCESS(PORTH,6)
// PORTE<CCP7E>
extern volatile __bit                   CCP7E               __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 CCP7E_bit           _BIT_ACCESS(PORTE,5)
// PIE4<CCP7IE>
extern volatile __bit                   CCP7IE              __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 CCP7IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<CCP7IF>
extern volatile __bit                   CCP7IF              __at(0x7DAC);	// @ (0xFB5 * 8 + 4)
#define                                 CCP7IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<CCP7IP>
extern volatile __bit                   CCP7IP              __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 CCP7IP_bit          _BIT_ACCESS(IPR4,4)
// CCP7CON<CCP7M0>
extern volatile __bit                   CCP7M0              __at(0x7838);	// @ (0xF07 * 8 + 0)
#define                                 CCP7M0_bit          _BIT_ACCESS(CCP7CON,0)
// CCP7CON<CCP7M1>
extern volatile __bit                   CCP7M1              __at(0x7839);	// @ (0xF07 * 8 + 1)
#define                                 CCP7M1_bit          _BIT_ACCESS(CCP7CON,1)
// CCP7CON<CCP7M2>
extern volatile __bit                   CCP7M2              __at(0x783A);	// @ (0xF07 * 8 + 2)
#define                                 CCP7M2_bit          _BIT_ACCESS(CCP7CON,2)
// CCP7CON<CCP7M3>
extern volatile __bit                   CCP7M3              __at(0x783B);	// @ (0xF07 * 8 + 3)
#define                                 CCP7M3_bit          _BIT_ACCESS(CCP7CON,3)
// PMD0<CCP7MD>
extern volatile __bit                   CCP7MD              __at(0x77A4);	// @ (0xEF4 * 8 + 4)
#define                                 CCP7MD_bit          _BIT_ACCESS(PMD0,4)
// ODCON2<CCP7OD>
extern volatile __bit                   CCP7OD              __at(0x7754);	// @ (0xEEA * 8 + 4)
#define                                 CCP7OD_bit          _BIT_ACCESS(ODCON2,4)
// RPINR34_35<CCP7R0>
extern volatile __bit                   CCP7R0              __at(0x71DC);	// @ (0xE3B * 8 + 4)
#define                                 CCP7R0_bit          _BIT_ACCESS(RPINR34_35,4)
// RPINR34_35<CCP7R1>
extern volatile __bit                   CCP7R1              __at(0x71DD);	// @ (0xE3B * 8 + 5)
#define                                 CCP7R1_bit          _BIT_ACCESS(RPINR34_35,5)
// RPINR34_35<CCP7R2>
extern volatile __bit                   CCP7R2              __at(0x71DE);	// @ (0xE3B * 8 + 6)
#define                                 CCP7R2_bit          _BIT_ACCESS(RPINR34_35,6)
// RPINR34_35<CCP7R3>
extern volatile __bit                   CCP7R3              __at(0x71DF);	// @ (0xE3B * 8 + 7)
#define                                 CCP7R3_bit          _BIT_ACCESS(RPINR34_35,7)
// CCP7CON<CCP7X>
extern volatile __bit                   CCP7X               __at(0x783D);	// @ (0xF07 * 8 + 5)
#define                                 CCP7X_bit           _BIT_ACCESS(CCP7CON,5)
// CCP7CON<CCP7Y>
extern volatile __bit                   CCP7Y               __at(0x783C);	// @ (0xF07 * 8 + 4)
#define                                 CCP7Y_bit           _BIT_ACCESS(CCP7CON,4)
// PORTH<CCP8>
extern volatile __bit                   CCP8                __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 CCP8_bit            _BIT_ACCESS(PORTH,5)
// PORTE<CCP8E>
extern volatile __bit                   CCP8E               __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 CCP8E_bit           _BIT_ACCESS(PORTE,4)
// PIE4<CCP8IE>
extern volatile __bit                   CCP8IE              __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 CCP8IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<CCP8IF>
extern volatile __bit                   CCP8IF              __at(0x7DAD);	// @ (0xFB5 * 8 + 5)
#define                                 CCP8IF_bit          _BIT_ACCESS(PIR4,5)
// IPR4<CCP8IP>
extern volatile __bit                   CCP8IP              __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 CCP8IP_bit          _BIT_ACCESS(IPR4,5)
// CCP8CON<CCP8M0>
extern volatile __bit                   CCP8M0              __at(0x7A30);	// @ (0xF46 * 8 + 0)
#define                                 CCP8M0_bit          _BIT_ACCESS(CCP8CON,0)
// CCP8CON<CCP8M1>
extern volatile __bit                   CCP8M1              __at(0x7A31);	// @ (0xF46 * 8 + 1)
#define                                 CCP8M1_bit          _BIT_ACCESS(CCP8CON,1)
// CCP8CON<CCP8M2>
extern volatile __bit                   CCP8M2              __at(0x7A32);	// @ (0xF46 * 8 + 2)
#define                                 CCP8M2_bit          _BIT_ACCESS(CCP8CON,2)
// CCP8CON<CCP8M3>
extern volatile __bit                   CCP8M3              __at(0x7A33);	// @ (0xF46 * 8 + 3)
#define                                 CCP8M3_bit          _BIT_ACCESS(CCP8CON,3)
// PMD0<CCP8MD>
extern volatile __bit                   CCP8MD              __at(0x77A5);	// @ (0xEF4 * 8 + 5)
#define                                 CCP8MD_bit          _BIT_ACCESS(PMD0,5)
// ODCON2<CCP8OD>
extern volatile __bit                   CCP8OD              __at(0x7755);	// @ (0xEEA * 8 + 5)
#define                                 CCP8OD_bit          _BIT_ACCESS(ODCON2,5)
// RPINR36_37<CCP8R0>
extern volatile __bit                   CCP8R0              __at(0x71E0);	// @ (0xE3C * 8 + 0)
#define                                 CCP8R0_bit          _BIT_ACCESS(RPINR36_37,0)
// RPINR36_37<CCP8R1>
extern volatile __bit                   CCP8R1              __at(0x71E1);	// @ (0xE3C * 8 + 1)
#define                                 CCP8R1_bit          _BIT_ACCESS(RPINR36_37,1)
// RPINR36_37<CCP8R2>
extern volatile __bit                   CCP8R2              __at(0x71E2);	// @ (0xE3C * 8 + 2)
#define                                 CCP8R2_bit          _BIT_ACCESS(RPINR36_37,2)
// RPINR36_37<CCP8R3>
extern volatile __bit                   CCP8R3              __at(0x71E3);	// @ (0xE3C * 8 + 3)
#define                                 CCP8R3_bit          _BIT_ACCESS(RPINR36_37,3)
// CCP8CON<CCP8X>
extern volatile __bit                   CCP8X               __at(0x7A35);	// @ (0xF46 * 8 + 5)
#define                                 CCP8X_bit           _BIT_ACCESS(CCP8CON,5)
// CCP8CON<CCP8Y>
extern volatile __bit                   CCP8Y               __at(0x7A34);	// @ (0xF46 * 8 + 4)
#define                                 CCP8Y_bit           _BIT_ACCESS(CCP8CON,4)
// PORTH<CCP9>
extern volatile __bit                   CCP9                __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 CCP9_bit            _BIT_ACCESS(PORTH,4)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// PIE4<CCP9IE>
extern volatile __bit                   CCP9IE              __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 CCP9IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<CCP9IF>
extern volatile __bit                   CCP9IF              __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 CCP9IF_bit          _BIT_ACCESS(PIR4,6)
// IPR4<CCP9IP>
extern volatile __bit                   CCP9IP              __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 CCP9IP_bit          _BIT_ACCESS(IPR4,6)
// CCP9CON<CCP9M0>
extern volatile __bit                   CCP9M0              __at(0x7A18);	// @ (0xF43 * 8 + 0)
#define                                 CCP9M0_bit          _BIT_ACCESS(CCP9CON,0)
// CCP9CON<CCP9M1>
extern volatile __bit                   CCP9M1              __at(0x7A19);	// @ (0xF43 * 8 + 1)
#define                                 CCP9M1_bit          _BIT_ACCESS(CCP9CON,1)
// CCP9CON<CCP9M2>
extern volatile __bit                   CCP9M2              __at(0x7A1A);	// @ (0xF43 * 8 + 2)
#define                                 CCP9M2_bit          _BIT_ACCESS(CCP9CON,2)
// CCP9CON<CCP9M3>
extern volatile __bit                   CCP9M3              __at(0x7A1B);	// @ (0xF43 * 8 + 3)
#define                                 CCP9M3_bit          _BIT_ACCESS(CCP9CON,3)
// PMD0<CCP9MD>
extern volatile __bit                   CCP9MD              __at(0x77A6);	// @ (0xEF4 * 8 + 6)
#define                                 CCP9MD_bit          _BIT_ACCESS(PMD0,6)
// ODCON2<CCP9OD>
extern volatile __bit                   CCP9OD              __at(0x7756);	// @ (0xEEA * 8 + 6)
#define                                 CCP9OD_bit          _BIT_ACCESS(ODCON2,6)
// RPINR36_37<CCP9R0>
extern volatile __bit                   CCP9R0              __at(0x71E4);	// @ (0xE3C * 8 + 4)
#define                                 CCP9R0_bit          _BIT_ACCESS(RPINR36_37,4)
// RPINR36_37<CCP9R1>
extern volatile __bit                   CCP9R1              __at(0x71E5);	// @ (0xE3C * 8 + 5)
#define                                 CCP9R1_bit          _BIT_ACCESS(RPINR36_37,5)
// RPINR36_37<CCP9R2>
extern volatile __bit                   CCP9R2              __at(0x71E6);	// @ (0xE3C * 8 + 6)
#define                                 CCP9R2_bit          _BIT_ACCESS(RPINR36_37,6)
// RPINR36_37<CCP9R3>
extern volatile __bit                   CCP9R3              __at(0x71E7);	// @ (0xE3C * 8 + 7)
#define                                 CCP9R3_bit          _BIT_ACCESS(RPINR36_37,7)
// CCP9CON<CCP9X>
extern volatile __bit                   CCP9X               __at(0x7A1D);	// @ (0xF43 * 8 + 5)
#define                                 CCP9X_bit           _BIT_ACCESS(CCP9CON,5)
// CCP9CON<CCP9Y>
extern volatile __bit                   CCP9Y               __at(0x7A1C);	// @ (0xF43 * 8 + 4)
#define                                 CCP9Y_bit           _BIT_ACCESS(CCP9CON,4)
// OSCCON2<CF>
extern volatile __bit                   CF                  __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 CF_bit              _BIT_ACCESS(OSCCON2,3)
// ADCHS0L<CH0NA0>
extern volatile __bit                   CH0NA0              __at(0x7435);	// @ (0xE86 * 8 + 5)
#define                                 CH0NA0_bit          _BIT_ACCESS(ADCHS0L,5)
// ADCHS0L<CH0NA1>
extern volatile __bit                   CH0NA1              __at(0x7436);	// @ (0xE86 * 8 + 6)
#define                                 CH0NA1_bit          _BIT_ACCESS(ADCHS0L,6)
// ADCHS0L<CH0NA2>
extern volatile __bit                   CH0NA2              __at(0x7437);	// @ (0xE86 * 8 + 7)
#define                                 CH0NA2_bit          _BIT_ACCESS(ADCHS0L,7)
// ADCHS0H<CH0NB0>
extern volatile __bit                   CH0NB0              __at(0x743D);	// @ (0xE87 * 8 + 5)
#define                                 CH0NB0_bit          _BIT_ACCESS(ADCHS0H,5)
// ADCHS0H<CH0NB1>
extern volatile __bit                   CH0NB1              __at(0x743E);	// @ (0xE87 * 8 + 6)
#define                                 CH0NB1_bit          _BIT_ACCESS(ADCHS0H,6)
// ADCHS0H<CH0NB2>
extern volatile __bit                   CH0NB2              __at(0x743F);	// @ (0xE87 * 8 + 7)
#define                                 CH0NB2_bit          _BIT_ACCESS(ADCHS0H,7)
// ADCHS0L<CH0SA0>
extern volatile __bit                   CH0SA0              __at(0x7430);	// @ (0xE86 * 8 + 0)
#define                                 CH0SA0_bit          _BIT_ACCESS(ADCHS0L,0)
// ADCHS0L<CH0SA1>
extern volatile __bit                   CH0SA1              __at(0x7431);	// @ (0xE86 * 8 + 1)
#define                                 CH0SA1_bit          _BIT_ACCESS(ADCHS0L,1)
// ADCHS0L<CH0SA2>
extern volatile __bit                   CH0SA2              __at(0x7432);	// @ (0xE86 * 8 + 2)
#define                                 CH0SA2_bit          _BIT_ACCESS(ADCHS0L,2)
// ADCHS0L<CH0SA3>
extern volatile __bit                   CH0SA3              __at(0x7433);	// @ (0xE86 * 8 + 3)
#define                                 CH0SA3_bit          _BIT_ACCESS(ADCHS0L,3)
// ADCHS0L<CH0SA4>
extern volatile __bit                   CH0SA4              __at(0x7434);	// @ (0xE86 * 8 + 4)
#define                                 CH0SA4_bit          _BIT_ACCESS(ADCHS0L,4)
// ADCHS0H<CH0SB0>
extern volatile __bit                   CH0SB0              __at(0x7438);	// @ (0xE87 * 8 + 0)
#define                                 CH0SB0_bit          _BIT_ACCESS(ADCHS0H,0)
// ADCHS0H<CH0SB1>
extern volatile __bit                   CH0SB1              __at(0x7439);	// @ (0xE87 * 8 + 1)
#define                                 CH0SB1_bit          _BIT_ACCESS(ADCHS0H,1)
// ADCHS0H<CH0SB2>
extern volatile __bit                   CH0SB2              __at(0x743A);	// @ (0xE87 * 8 + 2)
#define                                 CH0SB2_bit          _BIT_ACCESS(ADCHS0H,2)
// ADCHS0H<CH0SB3>
extern volatile __bit                   CH0SB3              __at(0x743B);	// @ (0xE87 * 8 + 3)
#define                                 CH0SB3_bit          _BIT_ACCESS(ADCHS0H,3)
// ADCHS0H<CH0SB4>
extern volatile __bit                   CH0SB4              __at(0x743C);	// @ (0xE87 * 8 + 4)
#define                                 CH0SB4_bit          _BIT_ACCESS(ADCHS0H,4)
// ADCHIT0L<CHH0>
extern volatile __bit                   CHH0                __at(0x73F0);	// @ (0xE7E * 8 + 0)
#define                                 CHH0_bit            _BIT_ACCESS(ADCHIT0L,0)
// ADCHIT0L<CHH1>
extern volatile __bit                   CHH1                __at(0x73F1);	// @ (0xE7E * 8 + 1)
#define                                 CHH1_bit            _BIT_ACCESS(ADCHIT0L,1)
// ADCHIT0H<CHH10>
extern volatile __bit                   CHH10               __at(0x73FA);	// @ (0xE7F * 8 + 2)
#define                                 CHH10_bit           _BIT_ACCESS(ADCHIT0H,2)
// ADCHIT0H<CHH11>
extern volatile __bit                   CHH11               __at(0x73FB);	// @ (0xE7F * 8 + 3)
#define                                 CHH11_bit           _BIT_ACCESS(ADCHIT0H,3)
// ADCHIT0H<CHH12>
extern volatile __bit                   CHH12               __at(0x73FC);	// @ (0xE7F * 8 + 4)
#define                                 CHH12_bit           _BIT_ACCESS(ADCHIT0H,4)
// ADCHIT0H<CHH13>
extern volatile __bit                   CHH13               __at(0x73FD);	// @ (0xE7F * 8 + 5)
#define                                 CHH13_bit           _BIT_ACCESS(ADCHIT0H,5)
// ADCHIT0H<CHH14>
extern volatile __bit                   CHH14               __at(0x73FE);	// @ (0xE7F * 8 + 6)
#define                                 CHH14_bit           _BIT_ACCESS(ADCHIT0H,6)
// ADCHIT0H<CHH15>
extern volatile __bit                   CHH15               __at(0x73FF);	// @ (0xE7F * 8 + 7)
#define                                 CHH15_bit           _BIT_ACCESS(ADCHIT0H,7)
// ADCHIT1L<CHH16>
extern volatile __bit                   CHH16               __at(0x7400);	// @ (0xE80 * 8 + 0)
#define                                 CHH16_bit           _BIT_ACCESS(ADCHIT1L,0)
// ADCHIT1L<CHH17>
extern volatile __bit                   CHH17               __at(0x7401);	// @ (0xE80 * 8 + 1)
#define                                 CHH17_bit           _BIT_ACCESS(ADCHIT1L,1)
// ADCHIT1L<CHH18>
extern volatile __bit                   CHH18               __at(0x7402);	// @ (0xE80 * 8 + 2)
#define                                 CHH18_bit           _BIT_ACCESS(ADCHIT1L,2)
// ADCHIT1L<CHH19>
extern volatile __bit                   CHH19               __at(0x7403);	// @ (0xE80 * 8 + 3)
#define                                 CHH19_bit           _BIT_ACCESS(ADCHIT1L,3)
// ADCHIT0L<CHH2>
extern volatile __bit                   CHH2                __at(0x73F2);	// @ (0xE7E * 8 + 2)
#define                                 CHH2_bit            _BIT_ACCESS(ADCHIT0L,2)
// ADCHIT1L<CHH20>
