MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
#define                                 CTMUEN23_bit        _BIT_ACCESS(ADCTMUEN1L,7)
// ADCTMUEN0L<CTMUEN3>
extern volatile __bit                   CTMUEN3             __at(0x73D3);	// @ (0xE7A * 8 + 3)
#define                                 CTMUEN3_bit         _BIT_ACCESS(ADCTMUEN0L,3)
// ADCTMUEN1H<CTMUEN30>
extern volatile __bit                   CTMUEN30            __at(0x73EE);	// @ (0xE7D * 8 + 6)
#define                                 CTMUEN30_bit        _BIT_ACCESS(ADCTMUEN1H,6)
// ADCTMUEN0L<CTMUEN4>
extern volatile __bit                   CTMUEN4             __at(0x73D4);	// @ (0xE7A * 8 + 4)
#define                                 CTMUEN4_bit         _BIT_ACCESS(ADCTMUEN0L,4)
// ADCTMUEN0L<CTMUEN5>
extern volatile __bit                   CTMUEN5             __at(0x73D5);	// @ (0xE7A * 8 + 5)
#define                                 CTMUEN5_bit         _BIT_ACCESS(ADCTMUEN0L,5)
// ADCTMUEN0L<CTMUEN6>
extern volatile __bit                   CTMUEN6             __at(0x73D6);	// @ (0xE7A * 8 + 6)
#define                                 CTMUEN6_bit         _BIT_ACCESS(ADCTMUEN0L,6)
// ADCTMUEN0L<CTMUEN7>
extern volatile __bit                   CTMUEN7             __at(0x73D7);	// @ (0xE7A * 8 + 7)
#define                                 CTMUEN7_bit         _BIT_ACCESS(ADCTMUEN0L,7)
// ADCTMUEN0H<CTMUEN8>
extern volatile __bit                   CTMUEN8             __at(0x73D8);	// @ (0xE7B * 8 + 0)
#define                                 CTMUEN8_bit         _BIT_ACCESS(ADCTMUEN0H,0)
// ADCTMUEN0H<CTMUEN9>
extern volatile __bit                   CTMUEN9             __at(0x73D9);	// @ (0xE7B * 8 + 1)
#define                                 CTMUEN9_bit         _BIT_ACCESS(ADCTMUEN0H,1)
// PIE3<CTMUIE>
extern volatile __bit                   CTMUIE              __at(0x7D1B);	// @ (0xFA3 * 8 + 3)
#define                                 CTMUIE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<CTMUIF>
extern volatile __bit                   CTMUIF              __at(0x7D23);	// @ (0xFA4 * 8 + 3)
#define                                 CTMUIF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<CTMUIP>
extern volatile __bit                   CTMUIP              __at(0x7D2B);	// @ (0xFA5 * 8 + 3)
#define                                 CTMUIP_bit          _BIT_ACCESS(IPR3,3)
// PMD3<CTMUMD>
extern volatile __bit                   CTMUMD              __at(0x778E);	// @ (0xEF1 * 8 + 6)
#define                                 CTMUMD_bit          _BIT_ACCESS(PMD3,6)
// ADCON5H<CTMUREQ>
extern volatile __bit                   CTMUREQ             __at(0x744D);	// @ (0xE89 * 8 + 5)
#define                                 CTMUREQ_bit         _BIT_ACCESS(ADCON5H,5)
// CTMUCON1<CTMUSIDL>
extern volatile __bit                   CTMUSIDL            __at(0x77C5);	// @ (0xEF8 * 8 + 5)
#define                                 CTMUSIDL_bit        _BIT_ACCESS(CTMUCON1,5)
// CTMUCON1<CTTRIG>
extern volatile __bit                   CTTRIG              __at(0x77C0);	// @ (0xEF8 * 8 + 0)
#define                                 CTTRIG_bit          _BIT_ACCESS(CTMUCON1,0)
// ADCTMUEN1L<CTUMEN16>
extern volatile __bit                   CTUMEN16            __at(0x73E0);	// @ (0xE7C * 8 + 0)
#define                                 CTUMEN16_bit        _BIT_ACCESS(ADCTMUEN1L,0)
// ADCTMUEN1L<CTUMEN17>
extern volatile __bit                   CTUMEN17            __at(0x73E1);	// @ (0xE7C * 8 + 1)
#define                                 CTUMEN17_bit        _BIT_ACCESS(ADCTMUEN1L,1)
// ADCTMUEN1L<CTUMEN18>
extern volatile __bit                   CTUMEN18            __at(0x73E2);	// @ (0xE7C * 8 + 2)
#define                                 CTUMEN18_bit        _BIT_ACCESS(ADCTMUEN1L,2)
// ADCTMUEN1L<CTUMEN19>
extern volatile __bit                   CTUMEN19            __at(0x73E3);	// @ (0xE7C * 8 + 3)
#define                                 CTUMEN19_bit        _BIT_ACCESS(ADCTMUEN1L,3)
// ADCTMUEN1H<CTUMEN24>
extern volatile __bit                   CTUMEN24            __at(0x73E8);	// @ (0xE7D * 8 + 0)
#define                                 CTUMEN24_bit        _BIT_ACCESS(ADCTMUEN1H,0)
// ADCTMUEN1H<CTUMEN25>
extern volatile __bit                   CTUMEN25            __at(0x73E9);	// @ (0xE7D * 8 + 1)
#define                                 CTUMEN25_bit        _BIT_ACCESS(ADCTMUEN1H,1)
// ADCTMUEN1H<CTUMEN26>
extern volatile __bit                   CTUMEN26            __at(0x73EA);	// @ (0xE7D * 8 + 2)
#define                                 CTUMEN26_bit        _BIT_ACCESS(ADCTMUEN1H,2)
// ADCTMUEN1H<CTUMEN27>
extern volatile __bit                   CTUMEN27            __at(0x73EB);	// @ (0xE7D * 8 + 3)
#define                                 CTUMEN27_bit        _BIT_ACCESS(ADCTMUEN1H,3)
// ADCTMUEN1H<CTUMEN28>
extern volatile __bit                   CTUMEN28            __at(0x73EC);	// @ (0xE7D * 8 + 4)
#define                                 CTUMEN28_bit        _BIT_ACCESS(ADCTMUEN1H,4)
// ADCTMUEN1H<CTUMEN29>
extern volatile __bit                   CTUMEN29            __at(0x73ED);	// @ (0xE7D * 8 + 5)
#define                                 CTUMEN29_bit        _BIT_ACCESS(ADCTMUEN1H,5)
// CVRCONH<CVR0>
extern volatile __bit                   CVR0                __at(0x7DF8);	// @ (0xFBF * 8 + 0)
#define                                 CVR0_bit            _BIT_ACCESS(CVRCONH,0)
// CVRCONH<CVR1>
extern volatile __bit                   CVR1                __at(0x7DF9);	// @ (0xFBF * 8 + 1)
#define                                 CVR1_bit            _BIT_ACCESS(CVRCONH,1)
// CVRCONH<CVR2>
extern volatile __bit                   CVR2                __at(0x7DFA);	// @ (0xFBF * 8 + 2)
#define                                 CVR2_bit            _BIT_ACCESS(CVRCONH,2)
// CVRCONH<CVR3>
extern volatile __bit                   CVR3                __at(0x7DFB);	// @ (0xFBF * 8 + 3)
#define                                 CVR3_bit            _BIT_ACCESS(CVRCONH,3)
// CVRCONH<CVR4>
extern volatile __bit                   CVR4                __at(0x7DFC);	// @ (0xFBF * 8 + 4)
#define                                 CVR4_bit            _BIT_ACCESS(CVRCONH,4)
// CVRCONL<CVREN>
extern volatile __bit                   CVREN               __at(0x7DF7);	// @ (0xFBE * 8 + 7)
#define                                 CVREN_bit           _BIT_ACCESS(CVRCONL,7)
// CVRCONL<CVRNSS>
extern volatile __bit                   CVRNSS              __at(0x7DF0);	// @ (0xFBE * 8 + 0)
#define                                 CVRNSS_bit          _BIT_ACCESS(CVRCONL,0)
// CVRCONL<CVROE>
extern volatile __bit                   CVROE               __at(0x7DF6);	// @ (0xFBE * 8 + 6)
#define                                 CVROE_bit           _BIT_ACCESS(CVRCONL,6)
// CVRCONL<CVRPSS0>
extern volatile __bit                   CVRPSS0             __at(0x7DF4);	// @ (0xFBE * 8 + 4)
#define                                 CVRPSS0_bit         _BIT_ACCESS(CVRCONL,4)
// CVRCONL<CVRPSS1>
extern volatile __bit                   CVRPSS1             __at(0x7DF5);	// @ (0xFBE * 8 + 5)
#define                                 CVRPSS1_bit         _BIT_ACCESS(CVRCONL,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<DATA_ADDRESS1>
extern volatile __bit                   DATA_ADDRESS1       __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS1_bit   _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP10CON<DC10B0>
extern volatile __bit                   DC10B0              __at(0x7A04);	// @ (0xF40 * 8 + 4)
#define                                 DC10B0_bit          _BIT_ACCESS(CCP10CON,4)
// CCP10CON<DC10B1>
extern volatile __bit                   DC10B1              __at(0x7A05);	// @ (0xF40 * 8 + 5)
#define                                 DC10B1_bit          _BIT_ACCESS(CCP10CON,5)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7A74);	// @ (0xF4E * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7A75);	// @ (0xF4E * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// CCP3CON<DC3B0>
extern volatile __bit                   DC3B0               __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 DC3B0_bit           _BIT_ACCESS(CCP3CON,4)
// CCP3CON<DC3B1>
extern volatile __bit                   DC3B1               __at(0x7A4D);	// @ (0xF49 * 8 + 5)
#define                                 DC3B1_bit           _BIT_ACCESS(CCP3CON,5)
// CCP4CON<DC4B0>
extern volatile __bit                   DC4B0               __at(0x7884);	// @ (0xF10 * 8 + 4)
#define                                 DC4B0_bit           _BIT_ACCESS(CCP4CON,4)
// CCP4CON<DC4B1>
extern volatile __bit                   DC4B1               __at(0x7885);	// @ (0xF10 * 8 + 5)
#define                                 DC4B1_bit           _BIT_ACCESS(CCP4CON,5)
// CCP5CON<DC5B0>
extern volatile __bit                   DC5B0               __at(0x786C);	// @ (0xF0D * 8 + 4)
#define                                 DC5B0_bit           _BIT_ACCESS(CCP5CON,4)
// CCP5CON<DC5B1>
extern volatile __bit                   DC5B1               __at(0x786D);	// @ (0xF0D * 8 + 5)
#define                                 DC5B1_bit           _BIT_ACCESS(CCP5CON,5)
// CCP6CON<DC6B0>
extern volatile __bit                   DC6B0               __at(0x7854);	// @ (0xF0A * 8 + 4)
#define                                 DC6B0_bit           _BIT_ACCESS(CCP6CON,4)
// CCP6CON<DC6B1>
extern volatile __bit                   DC6B1               __at(0x7855);	// @ (0xF0A * 8 + 5)
#define                                 DC6B1_bit           _BIT_ACCESS(CCP6CON,5)
// CCP7CON<DC7B0>
extern volatile __bit                   DC7B0               __at(0x783C);	// @ (0xF07 * 8 + 4)
#define                                 DC7B0_bit           _BIT_ACCESS(CCP7CON,4)
// CCP7CON<DC7B1>
extern volatile __bit                   DC7B1               __at(0x783D);	// @ (0xF07 * 8 + 5)
#define                                 DC7B1_bit           _BIT_ACCESS(CCP7CON,5)
// CCP8CON<DC8B0>
extern volatile __bit                   DC8B0               __at(0x7A34);	// @ (0xF46 * 8 + 4)
#define                                 DC8B0_bit           _BIT_ACCESS(CCP8CON,4)
// CCP8CON<DC8B1>
extern volatile __bit                   DC8B1               __at(0x7A35);	// @ (0xF46 * 8 + 5)
#define                                 DC8B1_bit           _BIT_ACCESS(CCP8CON,5)
// CCP9CON<DC9B0>
extern volatile __bit                   DC9B0               __at(0x7A1C);	// @ (0xF43 * 8 + 4)
#define                                 DC9B0_bit           _BIT_ACCESS(CCP9CON,4)
// CCP9CON<DC9B1>
extern volatile __bit                   DC9B1               __at(0x7A1D);	// @ (0xF43 * 8 + 5)
#define                                 DC9B1_bit           _BIT_ACCESS(CCP9CON,5)
// UEIE<DFN8EE>
extern volatile __bit                   DFN8EE              __at(0x707B);	// @ (0xE0F * 8 + 3)
#define                                 DFN8EE_bit          _BIT_ACCESS(UEIE,3)
// UEIR<DFN8EF>
extern volatile __bit                   DFN8EF              __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 DFN8EF_bit          _BIT_ACCESS(UEIR,3)
// USTAT<DIR>
extern volatile __bit                   DIR                 __at(0x7BB2);	// @ (0xF76 * 8 + 2)
#define                                 DIR_bit             _BIT_ACCESS(USTAT,2)
// DMACON2<DLYCYC0>
extern volatile __bit                   DLYCYC0             __at(0x7804);	// @ (0xF00 * 8 + 4)
#define                                 DLYCYC0_bit         _BIT_ACCESS(DMACON2,4)
// DMACON2<DLYCYC1>
extern volatile __bit                   DLYCYC1             __at(0x7805);	// @ (0xF00 * 8 + 5)
#define                                 DLYCYC1_bit         _BIT_ACCESS(DMACON2,5)
// DMACON2<DLYCYC2>
extern volatile __bit                   DLYCYC2             __at(0x7806);	// @ (0xF00 * 8 + 6)
#define                                 DLYCYC2_bit         _BIT_ACCESS(DMACON2,6)
// DMACON2<DLYCYC3>
extern volatile __bit                   DLYCYC3             __at(0x7807);	// @ (0xF00 * 8 + 7)
#define                                 DLYCYC3_bit         _BIT_ACCESS(DMACON2,7)
// DMACON1<DLYINTEN>
extern volatile __bit                   DLYINTEN            __at(0x7B01);	// @ (0xF60 * 8 + 1)
#define                                 DLYINTEN_bit        _BIT_ACCESS(DMACON1,1)
// DMACON1<DMAEN>
extern volatile __bit                   DMAEN               __at(0x7B00);	// @ (0xF60 * 8 + 0)
#define                                 DMAEN_bit           _BIT_ACCESS(DMACON1,0)
// ADCON1L<DONE>
extern volatile __bit                   DONE                __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON1L,0)
// RCON4<DPSLP>
extern volatile __bit                   DPSLP               __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 DPSLP_bit           _BIT_ACCESS(RCON4,2)
// DSCONL<DSBOR>
extern volatile __bit                   DSBOR               __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 DSBOR_bit           _BIT_ACCESS(DSCONL,1)
// DSCONH<DSEN>
extern volatile __bit                   DSEN                __at(0x793F);	// @ (0xF27 * 8 + 7)
#define                                 DSEN_bit            _BIT_ACCESS(DSCONH,7)
// DSWAKEL<DSFLT>
extern volatile __bit                   DSFLT               __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 DSFLT_bit           _BIT_ACCESS(DSWAKEL,7)
// DSWAKEL<DSICD>
extern volatile __bit                   DSICD               __at(0x7931);	// @ (0xF26 * 8 + 1)
#define                                 DSICD_bit           _BIT_ACCESS(DSWAKEL,1)
// DSWAKEH<DSINT0>
extern volatile __bit                   DSINT0              __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 DSINT0_bit          _BIT_ACCESS(DSWAKEH,0)
// DSWAKEL<DSMCLR>
extern volatile __bit                   DSMCLR              __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 DSMCLR_bit          _BIT_ACCESS(DSWAKEL,2)
// DSWAKEL<DSPOR>
extern volatile __bit                   DSPOR               __at(0x7930);	// @ (0xF26 * 8 + 0)
#define                                 DSPOR_bit           _BIT_ACCESS(DSWAKEL,0)
// DSWAKEL<DSRTC>
extern volatile __bit                   DSRTC               __at(0x7933);	// @ (0xF26 * 8 + 3)
#define                                 DSRTC_bit           _BIT_ACCESS(DSWAKEL,3)
// DSWAKEL<DSULP>
extern volatile __bit                   DSULP               __at(0x7935);	// @ (0xF26 * 8 + 5)
#define                                 DSULP_bit           _BIT_ACCESS(DSWAKEL,5)
// DSWAKEL<DSWDT>
extern volatile __bit                   DSWDT               __at(0x7934);	// @ (0xF26 * 8 + 4)
#define                                 DSWDT_bit           _BIT_ACCESS(DSWAKEL,4)
// BAUDCON1<DTRXP>
extern volatile __bit                   DTRXP               __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 DTRXP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<DTRXP1>
extern volatile __bit                   DTRXP1              __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 DTRXP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<DTRXP2>
extern volatile __bit                   DTRXP2              __at(0x798D);	// @ (0xF31 * 8 + 5)
#define                                 DTRXP2_bit          _BIT_ACCESS(BAUDCON2,5)
// BAUDCON3<DTRXP3>
extern volatile __bit                   DTRXP3              __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 DTRXP3_bit          _BIT_ACCESS(BAUDCON3,5)
// BAUDCON4<DTRXP4>
extern volatile __bit                   DTRXP4              __at(0x77ED);	// @ (0xEFD * 8 + 5)
#define                                 DTRXP4_bit          _BIT_ACCESS(BAUDCON4,5)
// DMACON1<DUPLEX0>
extern volatile __bit                   DUPLEX0             __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 DUPLEX0_bit         _BIT_ACCESS(DMACON1,2)
// DMACON1<DUPLEX1>
extern volatile __bit                   DUPLEX1             __at(0x7B03);	// @ (0xF60 * 8 + 3)
#define                                 DUPLEX1_bit         _BIT_ACCESS(DMACON1,3)
// SSP1STAT<D_A1>
extern volatile __bit                   D_A1                __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_A1_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_A2>
extern volatile __bit                   D_A2                __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 D_A2_bit            _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<D_NOT_A1>
extern volatile __bit                   D_NOT_A1            __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_NOT_A1_bit        _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_NOT_A2>
extern volatile __bit                   D_NOT_A2            __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 D_NOT_A2_bit        _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<D_nA1>
extern volatile __bit                   D_nA1               __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_nA1_bit           _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_nA2>
extern volatile __bit                   D_nA2               __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 D_nA2_bit           _BIT_ACCESS(SSP2STAT,5)
// MEMCON<EBDIS>
extern volatile __bit                   EBDIS               __at(0x771F);	// @ (0xEE3 * 8 + 7)
#define                                 EBDIS_bit           _BIT_ACCESS(MEMCON,7)
// ECCP1AS<ECCP1AS0>
extern volatile __bit                   ECCP1AS0            __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 ECCP1AS0_bit        _BIT_ACCESS(ECCP1AS,4)
// ECCP1AS<ECCP1AS1>
extern volatile __bit                   ECCP1AS1            __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 ECCP1AS1_bit        _BIT_ACCESS(ECCP1AS,5)
// ECCP1AS<ECCP1AS2>
extern volatile __bit                   ECCP1AS2            __at(0x7DEE);	// @ (0xFBD * 8 + 6)
#define                                 ECCP1AS2_bit        _BIT_ACCESS(ECCP1AS,6)
// ECCP1AS<ECCP1ASE>
extern volatile __bit                   ECCP1ASE            __at(0x7DEF);	// @ (0xFBD * 8 + 7)
#define                                 ECCP1ASE_bit        _BIT_ACCESS(ECCP1AS,7)
// PMD1<ECCP1MD>
extern volatile __bit                   ECCP1MD             __at(0x779E);	// @ (0xEF3 * 8 + 6)
#define                                 ECCP1MD_bit         _BIT_ACCESS(PMD1,6)
// ODCON1<ECCP1OD>
extern volatile __bit                   ECCP1OD             __at(0x775E);	// @ (0xEEB * 8 + 6)
#define                                 ECCP1OD_bit         _BIT_ACCESS(ODCON1,6)
// RPINR14_15<ECCP1R0>
extern volatile __bit                   ECCP1R0             __at(0x718C);	// @ (0xE31 * 8 + 4)
#define                                 ECCP1R0_bit         _BIT_ACCESS(RPINR14_15,4)
// RPINR14_15<ECCP1R1>
extern volatile __bit                   ECCP1R1             __at(0x718D);	// @ (0xE31 * 8 + 5)
#define                                 ECCP1R1_bit         _BIT_ACCESS(RPINR14_15,5)
// RPINR14_15<ECCP1R2>
extern volatile __bit                   ECCP1R2             __at(0x718E);	// @ (0xE31 * 8 + 6)
#define                                 ECCP1R2_bit         _BIT_ACCESS(RPINR14_15,6)
// RPINR14_15<ECCP1R3>
extern volatile __bit                   ECCP1R3             __at(0x718F);	// @ (0xE31 * 8 + 7)
#define                                 ECCP1R3_bit         _BIT_ACCESS(RPINR14_15,7)
// ECCP2AS<ECCP2AS0>
extern volatile __bit                   ECCP2AS0            __at(0x7A94);	// @ (0xF52 * 8 + 4)
#define                                 ECCP2AS0_bit        _BIT_ACCESS(ECCP2AS,4)
// ECCP2AS<ECCP2AS1>
extern volatile __bit                   ECCP2AS1            __at(0x7A95);	// @ (0xF52 * 8 + 5)
#define                                 ECCP2AS1_bit        _BIT_ACCESS(ECCP2AS,5)
// ECCP2AS<ECCP2AS2>
extern volatile __bit                   ECCP2AS2            __at(0x7A96);	// @ (0xF52 * 8 + 6)
#define                                 ECCP2AS2_bit        _BIT_ACCESS(ECCP2AS,6)
// ECCP2AS<ECCP2ASE>
extern volatile __bit                   ECCP2ASE            __at(0x7A97);	// @ (0xF52 * 8 + 7)
#define                                 ECCP2ASE_bit        _BIT_ACCESS(ECCP2AS,7)
// PMD1<ECCP2MD>
extern volatile __bit                   ECCP2MD             __at(0x779F);	// @ (0xEF3 * 8 + 7)
#define                                 ECCP2MD_bit         _BIT_ACCESS(PMD1,7)
// ODCON1<ECCP2OD>
extern volatile __bit                   ECCP2OD             __at(0x775F);	// @ (0xEEB * 8 + 7)
#define                                 ECCP2OD_bit         _BIT_ACCESS(ODCON1,7)
// RPINR16_17<ECCP2R0>
extern volatile __bit                   ECCP2R0             __at(0x7190);	// @ (0xE32 * 8 + 0)
#define                                 ECCP2R0_bit         _BIT_ACCESS(RPINR16_17,0)
// RPINR16_17<ECCP2R1>
extern volatile __bit                   ECCP2R1             __at(0x7191);	// @ (0xE32 * 8 + 1)
#define                                 ECCP2R1_bit         _BIT_ACCESS(RPINR16_17,1)
// RPINR16_17<ECCP2R2>
extern volatile __bit                   ECCP2R2             __at(0x7192);	// @ (0xE32 * 8 + 2)
#define                                 ECCP2R2_bit         _BIT_ACCESS(RPINR16_17,2)
// RPINR16_17<ECCP2R3>
extern volatile __bit                   ECCP2R3             __at(0x7193);	// @ (0xE32 * 8 + 3)
#define                                 ECCP2R3_bit         _BIT_ACCESS(RPINR16_17,3)
// ECCP3AS<ECCP3AS0>
extern volatile __bit                   ECCP3AS0            __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 ECCP3AS0_bit        _BIT_ACCESS(ECCP3AS,4)
// ECCP3AS<ECCP3AS1>
extern volatile __bit                   ECCP3AS1            __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 ECCP3AS1_bit        _BIT_ACCESS(ECCP3AS,5)
// ECCP3AS<ECCP3AS2>
extern volatile __bit                   ECCP3AS2            __at(0x7A6E);	// @ (0xF4D * 8 + 6)
#define                                 ECCP3AS2_bit        _BIT_ACCESS(ECCP3AS,6)
// ECCP3AS<ECCP3ASE>
extern volatile __bit                   ECCP3ASE            __at(0x7A6F);	// @ (0xF4D * 8 + 7)
#define                                 ECCP3ASE_bit        _BIT_ACCESS(ECCP3AS,7)
// PIE4<ECCP3IE>
extern volatile __bit                   ECCP3IE             __at(0x7DA0);	// @ (0xFB4 * 8 + 0)
#define                                 ECCP3IE_bit         _BIT_ACCESS(PIE4,0)
// PIR4<ECCP3IF>
extern volatile __bit                   ECCP3IF             __at(0x7DA8);	// @ (0xFB5 * 8 + 0)
