MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J94/mcu.h
extern volatile __bit                   P1DC22              __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 P1DC22_bit          _BIT_ACCESS(PSTR1CON,2)
// PSTR1CON<P1DC2CON>
extern volatile __bit                   P1DC2CON            __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 P1DC2CON_bit        _BIT_ACCESS(PSTR1CON,2)
// ECCP1DEL<P1DC3>
extern volatile __bit                   P1DC3               __at(0x7DE3);	// @ (0xFBC * 8 + 3)
#define                                 P1DC3_bit           _BIT_ACCESS(ECCP1DEL,3)
// PSTR1CON<P1DC32>
extern volatile __bit                   P1DC32              __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 P1DC32_bit          _BIT_ACCESS(PSTR1CON,3)
// PSTR1CON<P1DC3CON>
extern volatile __bit                   P1DC3CON            __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 P1DC3CON_bit        _BIT_ACCESS(PSTR1CON,3)
// ECCP1DEL<P1DC4>
extern volatile __bit                   P1DC4               __at(0x7DE4);	// @ (0xFBC * 8 + 4)
#define                                 P1DC4_bit           _BIT_ACCESS(ECCP1DEL,4)
// PSTR1CON<P1DC42>
extern volatile __bit                   P1DC42              __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 P1DC42_bit          _BIT_ACCESS(PSTR1CON,4)
// PSTR1CON<P1DC4CON>
extern volatile __bit                   P1DC4CON            __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 P1DC4CON_bit        _BIT_ACCESS(PSTR1CON,4)
// ECCP1DEL<P1DC5>
extern volatile __bit                   P1DC5               __at(0x7DE5);	// @ (0xFBC * 8 + 5)
#define                                 P1DC5_bit           _BIT_ACCESS(ECCP1DEL,5)
// ECCP1DEL<P1DC6>
extern volatile __bit                   P1DC6               __at(0x7DE6);	// @ (0xFBC * 8 + 6)
#define                                 P1DC6_bit           _BIT_ACCESS(ECCP1DEL,6)
// PSTR1CON<P1DC62>
extern volatile __bit                   P1DC62              __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 P1DC62_bit          _BIT_ACCESS(PSTR1CON,6)
// PSTR1CON<P1DC6CON>
extern volatile __bit                   P1DC6CON            __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 P1DC6CON_bit        _BIT_ACCESS(PSTR1CON,6)
// CCP1CON<P1M0>
extern volatile __bit                   P1M0                __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 P1M0_bit            _BIT_ACCESS(CCP1CON,6)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x7DCF);	// @ (0xFB9 * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// ECCP1DEL<P1RSEN>
extern volatile __bit                   P1RSEN              __at(0x7DE7);	// @ (0xFBC * 8 + 7)
#define                                 P1RSEN_bit          _BIT_ACCESS(ECCP1DEL,7)
// ECCP2DEL<P2DC0>
extern volatile __bit                   P2DC0               __at(0x7A88);	// @ (0xF51 * 8 + 0)
#define                                 P2DC0_bit           _BIT_ACCESS(ECCP2DEL,0)
// PSTR2CON<P2DC02>
extern volatile __bit                   P2DC02              __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 P2DC02_bit          _BIT_ACCESS(PSTR2CON,0)
// PSTR2CON<P2DC0CON>
extern volatile __bit                   P2DC0CON            __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 P2DC0CON_bit        _BIT_ACCESS(PSTR2CON,0)
// ECCP2DEL<P2DC1>
extern volatile __bit                   P2DC1               __at(0x7A89);	// @ (0xF51 * 8 + 1)
#define                                 P2DC1_bit           _BIT_ACCESS(ECCP2DEL,1)
// PSTR2CON<P2DC12>
extern volatile __bit                   P2DC12              __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 P2DC12_bit          _BIT_ACCESS(PSTR2CON,1)
// PSTR2CON<P2DC1CON>
extern volatile __bit                   P2DC1CON            __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 P2DC1CON_bit        _BIT_ACCESS(PSTR2CON,1)
// ECCP2DEL<P2DC2>
extern volatile __bit                   P2DC2               __at(0x7A8A);	// @ (0xF51 * 8 + 2)
#define                                 P2DC2_bit           _BIT_ACCESS(ECCP2DEL,2)
// PSTR2CON<P2DC22>
extern volatile __bit                   P2DC22              __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 P2DC22_bit          _BIT_ACCESS(PSTR2CON,2)
// PSTR2CON<P2DC2CON>
extern volatile __bit                   P2DC2CON            __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 P2DC2CON_bit        _BIT_ACCESS(PSTR2CON,2)
// ECCP2DEL<P2DC3>
extern volatile __bit                   P2DC3               __at(0x7A8B);	// @ (0xF51 * 8 + 3)
#define                                 P2DC3_bit           _BIT_ACCESS(ECCP2DEL,3)
// PSTR2CON<P2DC32>
extern volatile __bit                   P2DC32              __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 P2DC32_bit          _BIT_ACCESS(PSTR2CON,3)
// PSTR2CON<P2DC3CON>
extern volatile __bit                   P2DC3CON            __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 P2DC3CON_bit        _BIT_ACCESS(PSTR2CON,3)
// ECCP2DEL<P2DC4>
extern volatile __bit                   P2DC4               __at(0x7A8C);	// @ (0xF51 * 8 + 4)
#define                                 P2DC4_bit           _BIT_ACCESS(ECCP2DEL,4)
// PSTR2CON<P2DC42>
extern volatile __bit                   P2DC42              __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 P2DC42_bit          _BIT_ACCESS(PSTR2CON,4)
// PSTR2CON<P2DC4CON>
extern volatile __bit                   P2DC4CON            __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 P2DC4CON_bit        _BIT_ACCESS(PSTR2CON,4)
// ECCP2DEL<P2DC5>
extern volatile __bit                   P2DC5               __at(0x7A8D);	// @ (0xF51 * 8 + 5)
#define                                 P2DC5_bit           _BIT_ACCESS(ECCP2DEL,5)
// ECCP2DEL<P2DC6>
extern volatile __bit                   P2DC6               __at(0x7A8E);	// @ (0xF51 * 8 + 6)
#define                                 P2DC6_bit           _BIT_ACCESS(ECCP2DEL,6)
// PSTR2CON<P2DC62>
extern volatile __bit                   P2DC62              __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 P2DC62_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR2CON<P2DC6CON>
extern volatile __bit                   P2DC6CON            __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 P2DC6CON_bit        _BIT_ACCESS(PSTR2CON,6)
// CCP2CON<P2M0>
extern volatile __bit                   P2M0                __at(0x7A76);	// @ (0xF4E * 8 + 6)
#define                                 P2M0_bit            _BIT_ACCESS(CCP2CON,6)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x7A77);	// @ (0xF4E * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// ECCP2DEL<P2RSEN>
extern volatile __bit                   P2RSEN              __at(0x7A8F);	// @ (0xF51 * 8 + 7)
#define                                 P2RSEN_bit          _BIT_ACCESS(ECCP2DEL,7)
// ECCP3DEL<P3DC0>
extern volatile __bit                   P3DC0               __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 P3DC0_bit           _BIT_ACCESS(ECCP3DEL,0)
// PSTR3CON<P3DC02>
extern volatile __bit                   P3DC02              __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 P3DC02_bit          _BIT_ACCESS(PSTR3CON,0)
// PSTR3CON<P3DC0CON>
extern volatile __bit                   P3DC0CON            __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 P3DC0CON_bit        _BIT_ACCESS(PSTR3CON,0)
// ECCP3DEL<P3DC1>
extern volatile __bit                   P3DC1               __at(0x7A61);	// @ (0xF4C * 8 + 1)
#define                                 P3DC1_bit           _BIT_ACCESS(ECCP3DEL,1)
// PSTR3CON<P3DC12>
extern volatile __bit                   P3DC12              __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 P3DC12_bit          _BIT_ACCESS(PSTR3CON,1)
// PSTR3CON<P3DC1CON>
extern volatile __bit                   P3DC1CON            __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 P3DC1CON_bit        _BIT_ACCESS(PSTR3CON,1)
// ECCP3DEL<P3DC2>
extern volatile __bit                   P3DC2               __at(0x7A62);	// @ (0xF4C * 8 + 2)
#define                                 P3DC2_bit           _BIT_ACCESS(ECCP3DEL,2)
// PSTR3CON<P3DC22>
extern volatile __bit                   P3DC22              __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 P3DC22_bit          _BIT_ACCESS(PSTR3CON,2)
// PSTR3CON<P3DC2CON>
extern volatile __bit                   P3DC2CON            __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 P3DC2CON_bit        _BIT_ACCESS(PSTR3CON,2)
// ECCP3DEL<P3DC3>
extern volatile __bit                   P3DC3               __at(0x7A63);	// @ (0xF4C * 8 + 3)
#define                                 P3DC3_bit           _BIT_ACCESS(ECCP3DEL,3)
// PSTR3CON<P3DC32>
extern volatile __bit                   P3DC32              __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 P3DC32_bit          _BIT_ACCESS(PSTR3CON,3)
// PSTR3CON<P3DC3CON>
extern volatile __bit                   P3DC3CON            __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 P3DC3CON_bit        _BIT_ACCESS(PSTR3CON,3)
// ECCP3DEL<P3DC4>
extern volatile __bit                   P3DC4               __at(0x7A64);	// @ (0xF4C * 8 + 4)
#define                                 P3DC4_bit           _BIT_ACCESS(ECCP3DEL,4)
// PSTR3CON<P3DC42>
extern volatile __bit                   P3DC42              __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 P3DC42_bit          _BIT_ACCESS(PSTR3CON,4)
// PSTR3CON<P3DC4CON>
extern volatile __bit                   P3DC4CON            __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 P3DC4CON_bit        _BIT_ACCESS(PSTR3CON,4)
// ECCP3DEL<P3DC5>
extern volatile __bit                   P3DC5               __at(0x7A65);	// @ (0xF4C * 8 + 5)
#define                                 P3DC5_bit           _BIT_ACCESS(ECCP3DEL,5)
// ECCP3DEL<P3DC6>
extern volatile __bit                   P3DC6               __at(0x7A66);	// @ (0xF4C * 8 + 6)
#define                                 P3DC6_bit           _BIT_ACCESS(ECCP3DEL,6)
// PSTR3CON<P3DC62>
extern volatile __bit                   P3DC62              __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 P3DC62_bit          _BIT_ACCESS(PSTR3CON,6)
// PSTR3CON<P3DC6CON>
extern volatile __bit                   P3DC6CON            __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 P3DC6CON_bit        _BIT_ACCESS(PSTR3CON,6)
// CCP3CON<P3M0>
extern volatile __bit                   P3M0                __at(0x7A4E);	// @ (0xF49 * 8 + 6)
#define                                 P3M0_bit            _BIT_ACCESS(CCP3CON,6)
// CCP3CON<P3M1>
extern volatile __bit                   P3M1                __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 P3M1_bit            _BIT_ACCESS(CCP3CON,7)
// ECCP3DEL<P3RSEN>
extern volatile __bit                   P3RSEN              __at(0x7A67);	// @ (0xF4C * 8 + 7)
#define                                 P3RSEN_bit          _BIT_ACCESS(ECCP3DEL,7)
// PORTC<PA1>
extern volatile __bit                   _PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)  // Note: Changed by MikroE
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   _PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)  // Note: Changed by MikroE
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PA2E>
extern volatile __bit                   PA2E                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 PA2E_bit            _BIT_ACCESS(PORTE,7)
// PORTH<PB1>
extern volatile __bit                   _PB1                 __at(0x7C3F);	// @ (0xF87 * 8 + 7)  // Note: Changed by MikroE
#define                                 PB1_bit             _BIT_ACCESS(PORTH,7)
// PORTE<PB1E>
extern volatile __bit                   PB1E                __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 PB1E_bit            _BIT_ACCESS(PORTE,6)
// PORTE<PB2>
extern volatile __bit                   _PB2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)  // Note: Changed by MikroE
#define                                 PB2_bit             _BIT_ACCESS(PORTE,2)
// PORTH<PB3>
extern volatile __bit                   _PB3                 __at(0x7C3D);	// @ (0xF87 * 8 + 5)  // Note: Changed by MikroE
#define                                 PB3_bit             _BIT_ACCESS(PORTH,5)
// PORTE<PB3E>
extern volatile __bit                   PB3E                __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 PB3E_bit            _BIT_ACCESS(PORTE,4)
// RPINR46_47<PBIO0R0>
extern volatile __bit                   PBIO0R0             __at(0x7208);	// @ (0xE41 * 8 + 0)
#define                                 PBIO0R0_bit         _BIT_ACCESS(RPINR46_47,0)
// RPINR46_47<PBIO0R1>
extern volatile __bit                   PBIO0R1             __at(0x7209);	// @ (0xE41 * 8 + 1)
#define                                 PBIO0R1_bit         _BIT_ACCESS(RPINR46_47,1)
// RPINR46_47<PBIO0R2>
extern volatile __bit                   PBIO0R2             __at(0x720A);	// @ (0xE41 * 8 + 2)
#define                                 PBIO0R2_bit         _BIT_ACCESS(RPINR46_47,2)
// RPINR46_47<PBIO0R3>
extern volatile __bit                   PBIO0R3             __at(0x720B);	// @ (0xE41 * 8 + 3)
#define                                 PBIO0R3_bit         _BIT_ACCESS(RPINR46_47,3)
// RPINR46_47<PBIO1R0>
extern volatile __bit                   PBIO1R0             __at(0x720C);	// @ (0xE41 * 8 + 4)
#define                                 PBIO1R0_bit         _BIT_ACCESS(RPINR46_47,4)
// RPINR46_47<PBIO1R1>
extern volatile __bit                   PBIO1R1             __at(0x720D);	// @ (0xE41 * 8 + 5)
#define                                 PBIO1R1_bit         _BIT_ACCESS(RPINR46_47,5)
// RPINR46_47<PBIO1R2>
extern volatile __bit                   PBIO1R2             __at(0x720E);	// @ (0xE41 * 8 + 6)
#define                                 PBIO1R2_bit         _BIT_ACCESS(RPINR46_47,6)
// RPINR46_47<PBIO1R3>
extern volatile __bit                   PBIO1R3             __at(0x720F);	// @ (0xE41 * 8 + 7)
#define                                 PBIO1R3_bit         _BIT_ACCESS(RPINR46_47,7)
// RPINR48_49<PBIO2R0>
extern volatile __bit                   PBIO2R0             __at(0x7210);	// @ (0xE42 * 8 + 0)
#define                                 PBIO2R0_bit         _BIT_ACCESS(RPINR48_49,0)
// RPINR48_49<PBIO2R1>
extern volatile __bit                   PBIO2R1             __at(0x7211);	// @ (0xE42 * 8 + 1)
#define                                 PBIO2R1_bit         _BIT_ACCESS(RPINR48_49,1)
// RPINR48_49<PBIO2R2>
extern volatile __bit                   PBIO2R2             __at(0x7212);	// @ (0xE42 * 8 + 2)
#define                                 PBIO2R2_bit         _BIT_ACCESS(RPINR48_49,2)
// RPINR48_49<PBIO2R3>
extern volatile __bit                   PBIO2R3             __at(0x7213);	// @ (0xE42 * 8 + 3)
#define                                 PBIO2R3_bit         _BIT_ACCESS(RPINR48_49,3)
// RPINR48_49<PBIO3R0>
extern volatile __bit                   PBIO3R0             __at(0x7214);	// @ (0xE42 * 8 + 4)
#define                                 PBIO3R0_bit         _BIT_ACCESS(RPINR48_49,4)
// RPINR48_49<PBIO3R1>
extern volatile __bit                   PBIO3R1             __at(0x7215);	// @ (0xE42 * 8 + 5)
#define                                 PBIO3R1_bit         _BIT_ACCESS(RPINR48_49,5)
// RPINR48_49<PBIO3R2>
extern volatile __bit                   PBIO3R2             __at(0x7216);	// @ (0xE42 * 8 + 6)
#define                                 PBIO3R2_bit         _BIT_ACCESS(RPINR48_49,6)
// RPINR48_49<PBIO3R3>
extern volatile __bit                   PBIO3R3             __at(0x7217);	// @ (0xE42 * 8 + 7)
#define                                 PBIO3R3_bit         _BIT_ACCESS(RPINR48_49,7)
// RPINR50_51<PBIO4R0>
extern volatile __bit                   PBIO4R0             __at(0x7218);	// @ (0xE43 * 8 + 0)
#define                                 PBIO4R0_bit         _BIT_ACCESS(RPINR50_51,0)
// RPINR50_51<PBIO4R1>
extern volatile __bit                   PBIO4R1             __at(0x7219);	// @ (0xE43 * 8 + 1)
#define                                 PBIO4R1_bit         _BIT_ACCESS(RPINR50_51,1)
// RPINR50_51<PBIO4R2>
extern volatile __bit                   PBIO4R2             __at(0x721A);	// @ (0xE43 * 8 + 2)
#define                                 PBIO4R2_bit         _BIT_ACCESS(RPINR50_51,2)
// RPINR50_51<PBIO4R3>
extern volatile __bit                   PBIO4R3             __at(0x721B);	// @ (0xE43 * 8 + 3)
#define                                 PBIO4R3_bit         _BIT_ACCESS(RPINR50_51,3)
// RPINR50_51<PBIO5R0>
extern volatile __bit                   PBIO5R0             __at(0x721C);	// @ (0xE43 * 8 + 4)
#define                                 PBIO5R0_bit         _BIT_ACCESS(RPINR50_51,4)
// RPINR50_51<PBIO5R1>
extern volatile __bit                   PBIO5R1             __at(0x721D);	// @ (0xE43 * 8 + 5)
#define                                 PBIO5R1_bit         _BIT_ACCESS(RPINR50_51,5)
// RPINR50_51<PBIO5R2>
extern volatile __bit                   PBIO5R2             __at(0x721E);	// @ (0xE43 * 8 + 6)
#define                                 PBIO5R2_bit         _BIT_ACCESS(RPINR50_51,6)
// RPINR50_51<PBIO5R3>
extern volatile __bit                   PBIO5R3             __at(0x721F);	// @ (0xE43 * 8 + 7)
#define                                 PBIO5R3_bit         _BIT_ACCESS(RPINR50_51,7)
// RPINR52_53<PBIO6R0>
extern volatile __bit                   PBIO6R0             __at(0x7220);	// @ (0xE44 * 8 + 0)
#define                                 PBIO6R0_bit         _BIT_ACCESS(RPINR52_53,0)
// RPINR52_53<PBIO6R1>
extern volatile __bit                   PBIO6R1             __at(0x7221);	// @ (0xE44 * 8 + 1)
#define                                 PBIO6R1_bit         _BIT_ACCESS(RPINR52_53,1)
// RPINR52_53<PBIO6R2>
extern volatile __bit                   PBIO6R2             __at(0x7222);	// @ (0xE44 * 8 + 2)
#define                                 PBIO6R2_bit         _BIT_ACCESS(RPINR52_53,2)
// RPINR52_53<PBIO6R3>
extern volatile __bit                   PBIO6R3             __at(0x7223);	// @ (0xE44 * 8 + 3)
#define                                 PBIO6R3_bit         _BIT_ACCESS(RPINR52_53,3)
// RPINR52_53<PBIO7R0>
extern volatile __bit                   PBIO7R0             __at(0x7224);	// @ (0xE44 * 8 + 4)
#define                                 PBIO7R0_bit         _BIT_ACCESS(RPINR52_53,4)
// RPINR52_53<PBIO7R1>
extern volatile __bit                   PBIO7R1             __at(0x7225);	// @ (0xE44 * 8 + 5)
#define                                 PBIO7R1_bit         _BIT_ACCESS(RPINR52_53,5)
// RPINR52_53<PBIO7R2>
extern volatile __bit                   PBIO7R2             __at(0x7226);	// @ (0xE44 * 8 + 6)
#define                                 PBIO7R2_bit         _BIT_ACCESS(RPINR52_53,6)
// RPINR52_53<PBIO7R3>
extern volatile __bit                   PBIO7R3             __at(0x7227);	// @ (0xE44 * 8 + 7)
#define                                 PBIO7R3_bit         _BIT_ACCESS(RPINR52_53,7)
// PORTH<PC1>
extern volatile __bit                   _PC1                 __at(0x7C3E);	// @ (0xF87 * 8 + 6)  // Note: Changed by MikroE
#define                                 PC1_bit             _BIT_ACCESS(PORTH,6)
// PORTE<PC1E>
extern volatile __bit                   PC1E                __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 PC1E_bit            _BIT_ACCESS(PORTE,5)
// PORTE<PC2>
extern volatile __bit                   _PC2                 __at(0x7C21);	// @ (0xF84 * 8 + 1)  // Note: Changed by MikroE
#define                                 PC2_bit             _BIT_ACCESS(PORTE,1)
// PORTH<PC3>
extern volatile __bit                   _PC3                 __at(0x7C3C);	// @ (0xF87 * 8 + 4)  // Note: Changed by MikroE
#define                                 PC3_bit             _BIT_ACCESS(PORTH,4)
// PORTE<PC3E>
extern volatile __bit                   PC3E                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 PC3E_bit            _BIT_ACCESS(PORTE,3)
// ANCON1<PCFG10>
extern volatile __bit                   PCFG10              __at(0x723A);	// @ (0xE47 * 8 + 2)
#define                                 PCFG10_bit          _BIT_ACCESS(ANCON1,2)
// ANCON1<PCFG11>
extern volatile __bit                   PCFG11              __at(0x723B);	// @ (0xE47 * 8 + 3)
#define                                 PCFG11_bit          _BIT_ACCESS(ANCON1,3)
// ANCON1<PCFG12>
extern volatile __bit                   PCFG12              __at(0x723C);	// @ (0xE47 * 8 + 4)
#define                                 PCFG12_bit          _BIT_ACCESS(ANCON1,4)
// ANCON1<PCFG13>
extern volatile __bit                   PCFG13              __at(0x723D);	// @ (0xE47 * 8 + 5)
#define                                 PCFG13_bit          _BIT_ACCESS(ANCON1,5)
// ANCON1<PCFG14>
extern volatile __bit                   PCFG14              __at(0x723E);	// @ (0xE47 * 8 + 6)
#define                                 PCFG14_bit          _BIT_ACCESS(ANCON1,6)
// ANCON1<PCFG15>
extern volatile __bit                   PCFG15              __at(0x723F);	// @ (0xE47 * 8 + 7)
#define                                 PCFG15_bit          _BIT_ACCESS(ANCON1,7)
// ANCON2<PCFG16>
extern volatile __bit                   PCFG16              __at(0x7230);	// @ (0xE46 * 8 + 0)
#define                                 PCFG16_bit          _BIT_ACCESS(ANCON2,0)
// ANCON2<PCFG17>
extern volatile __bit                   PCFG17              __at(0x7231);	// @ (0xE46 * 8 + 1)
#define                                 PCFG17_bit          _BIT_ACCESS(ANCON2,1)
// ANCON2<PCFG18>
extern volatile __bit                   PCFG18              __at(0x7232);	// @ (0xE46 * 8 + 2)
#define                                 PCFG18_bit          _BIT_ACCESS(ANCON2,2)
// ANCON2<PCFG19>
extern volatile __bit                   PCFG19              __at(0x7233);	// @ (0xE46 * 8 + 3)
#define                                 PCFG19_bit          _BIT_ACCESS(ANCON2,3)
// ANCON2<PCFG20>
extern volatile __bit                   PCFG20              __at(0x7234);	// @ (0xE46 * 8 + 4)
#define                                 PCFG20_bit          _BIT_ACCESS(ANCON2,4)
// ANCON2<PCFG21>
extern volatile __bit                   PCFG21              __at(0x7235);	// @ (0xE46 * 8 + 5)
#define                                 PCFG21_bit          _BIT_ACCESS(ANCON2,5)
// ANCON2<PCFG22>
extern volatile __bit                   PCFG22              __at(0x7236);	// @ (0xE46 * 8 + 6)
#define                                 PCFG22_bit          _BIT_ACCESS(ANCON2,6)
// ANCON2<PCFG23>
extern volatile __bit                   PCFG23              __at(0x7237);	// @ (0xE46 * 8 + 7)
#define                                 PCFG23_bit          _BIT_ACCESS(ANCON2,7)
// ANCON1<PCFG8>
extern volatile __bit                   PCFG8               __at(0x7238);	// @ (0xE47 * 8 + 0)
#define                                 PCFG8_bit           _BIT_ACCESS(ANCON1,0)
// ANCON1<PCFG9>
extern volatile __bit                   PCFG9               __at(0x7239);	// @ (0xE47 * 8 + 1)
